<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>

<!-- Mirrored from www.ccim.be/ccim328/archi/sources/site_qui_tue.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:38:54 GMT -->
<head>
   <meta name="copyright" content="© SAM-Magazine">
   <meta http-equiv="Reply-to" content="contact@sam-mag.com">
   <title>Cr&eacute;er le site qui gagne</title>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#CC33CC" vlink="#CC33CC" alink="#CC33CC">
&nbsp;
<center><table BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=2 WIDTH="600" >
<tr>
<td ALIGN=LEFT VALIGN=TOP WIDTH="468" BGCOLOR="#FFCC33"><b><font face="arial, helvetica"><font color="#000000"><font size=+1>&nbsp;Cr&eacute;er
le site qui gagne</font></font></font></b>
<br><b><font size=-1>&nbsp; Dossier de la <font color="#000000">semaine
du 22 au 28 juillet 1998</font></font></b></td>

<td><a href="http://www.sam-mag.com/" target="_top"><img SRC="sammag.GIF" ALT="SAM-Magazine" BORDER=0 height=90 width=130></a></td>
</tr>
</table></center>
&nbsp;
<center><table BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=1 WIDTH="600" >
<tr>
<td ALIGN=LEFT VALIGN=TOP WIDTH="468"><b><font face="arial, helvetica"><font color="#000000"><font size=-1>Par
<i><a href="mailto:pmonteiro@sam-mag.com">Philippe
Monteiro da Rocha</a></i></font></font></font></b>
<br><b><i><font face="arial, helvetica"><font color="#000000"><font size=-1>Consultant
de marketing en ligne</font></font></font></i></b>
<p><b><i><font color="#000000"><font size=+1>1&egrave;re partie:</font></font></i></b>
<br><b><font color="#000000">Pr&eacute;parer un site, ce n'est pas s'initier
&agrave; la programmation HTML, c'est comprendre le fonctionnement du web
et &eacute;tudier le comportement des internautes.</font></b>
<p><font color="#000099">D'apr&egrave;s des sources autoris&eacute;es comme
<a href="http://www.francite.com/" target="q">Francit&eacute;</a>,
il y a sans doute au moins une centaine de milliers de sites Internet sur
le web francophone. Et en pr&eacute;tendant qu'un petit millier d'entre
eux concentrent plus de 99% des intentions de visites des internautes francophones,
on est d&eacute;j&agrave; large. Croyez le ou non.</font>
<p><font color="#000099">Alors comment faire sa place au soleil et rejoindre
ce petit millier de sites &eacute;lus qui font les beaux jours de la francophonie
en ligne ? La trilogie "promotion-marketing-maintenance" si c'est un bon
d&eacute;part, ne doit pas &ecirc;tre une fin en soi. Un succ&egrave;s
dans le cyber-espace ne s'arr&ecirc;te certainement pas &agrave; un bon
positionnement chez Yahoo et cinq bandeaux &eacute;chang&eacute;s.</font>
<p><img SRC="courbes.GIF" height=137 width=200 align=LEFT><font color="#000099">R&eacute;ussir
sur internet, on va le voir, c'est avant tout atteindre ses objectifs.
Qu'ils soient purement commerciaux ou traduits en terme de trafic, ce sont
les buts que vous fixez au d&eacute;part qui d&eacute;termineront si votre
site remplit ou non la mission que vous lui avez confi&eacute;e. Si <a href="http://www.orangina.fr/">Orangina</a>,
qui propose son e-zine Move, souhaite essentiellement travailler son image,
<a href="http://www.fromages.com/">Fromages.com</a> pr&eacute;f&eacute;rerait
sans aucun doute vendre du Camembert !</font>
<p><b><font color="#000000">Cyber-us et coutumes virtuelles</font></b>
<br><font color="#000099">Les plus s&eacute;rieux analystes am&eacute;ricains
du march&eacute; virtuel avaient l'an pass&eacute; d&eacute;termin&eacute;s
cinq cat&eacute;gories de sites internet. Mais, &ccedil;a va si vite dans
le cyber-espace qu'on peut, un an apr&egrave;s, trouver au moins neuf groupes
de sites bien distincts:</font>
<ul>
<li>
<font color="#000099">Les <b>moteurs de recherche</b> et annuaires comme
<a href="http://www.francite.com/">Francit&eacute;</a></font></li>

<li>
<font color="#000099">Les <b>media en ligne</b> comme <a href="http://www.liberation.fr/">Lib&eacute;ration</a></font></li>

<li>
<font color="#000099">Les sites d'<b>information sp&eacute;cialis&eacute;e</b>
comme <a href="http://www.zdnet.fr/">ZDNet France</a></font></li>

<li>
<font color="#000099">Les sites de <b>promotion pure</b> comme <a href="http://www.orangina.fr/">Orangina</a></font></li>

<li>
<font color="#000099">Les sites de <b>commerce &eacute;lectronique</b>
comme <a href="http://www.fromages.com/">Fromages.com</a></font></li>

<li>
<font color="#000099">Les sites de <b>divertissement</b> comme <a href="http://www.baguette.com/">Baguette
Virtuelle</a></font></li>

<li>
<font color="#000099">Les sites de <b>services gratuits</b> comme <a href="http://www.caramail.com/">Caramail</a></font></li>

<li>
<font color="#000099">Les sites de <b>services financiers</b> comme <a href="http://www.bnpnet.bnp.fr/">BNP
Net</a></font></li>

<li>
<font color="#000099">Les <b>pages personnelles</b> comme <a href="http://pages.infinit.net/reneel/">La
page de Ren&eacute;e</a></font></li>
</ul>
<font color="#000099">Et encore, soyons persuad&eacute;s qu'en poussant
un peu plus loin la r&eacute;flexion, on pourrait trouver encore six ou
sept cat&eacute;gories suppl&eacute;mentaires. En outre, si le nouveau
venu sur Internet n'a de cesse de naviguer sur la toile, enthousiasm&eacute;
qu'il est par les sources illimit&eacute;es d'information qu'il d&eacute;couvre
&agrave; chaque clic de souris, on &eacute;tablit que "l'internaute confirm&eacute;"
- un an de service ! - ne visite plus r&eacute;guli&egrave;rement qu'une
douzaine de sites en tout et pour tout.</font>
<p><font color="#000099">Vous ne me croyez pas ? Comptez de m&eacute;moire
les sites que vous avez consult&eacute;s plus d'une fois depuis un mois.
Si vous arrivez &agrave; vingt, adressez moi un email, je serais fier d'annoncer
dans cette colonne que l'exception existe.</font>
<p><font color="#000099">L'exp&eacute;rience prouve qu'on ne revient jamais,
ou rarement, sur un site non mis-&agrave;-jour, mal maintenu ou ne pr&eacute;sentant
ni informations pertinentes, ni services probants (gratuits ou payants).
Or, ne manquerez-vous pas de remarquer, au moins 90% des sites sur Internet
sont purement promotionnels. De grosses brochures en couleurs flottant
sans cap pr&eacute;d&eacute;fini dans le cyber-espace… Ils existent, sont
inutiles pour la communaut&eacute; en ligne et sont donc abandonn&eacute;s
&agrave; leur triste sort.</font>
<p><b><font color="#000000">L'objectif avant le site, pas l'inverse</font></b>
<br><font color="#000099">L'erreur de base lorsqu'on d&eacute;veloppe un
site, c'est de le faire pour "&ecirc;tre sur internet" ou bien parce que
 la concurrence a d&eacute;j&agrave; lanc&eacute; son site." Prendriez-vous
le risque de faire un discours devant une assembl&eacute;e sans aucune
pr&eacute;paration et sans rien avoir &agrave; dire de consistant, simplement
parce que votre plus dangereux concurrent est sur la tribune ? Le web,
&ccedil;a peut-&ecirc;tre une tribune en or, c'est vrai, mais c'est souvent
un ab&icirc;me pour les orateurs sans discours.</font>
<p><font color="#000099">Un site doit donc avoir une fonction claire dans
votre organisation. Une vocation professionnelle ! L'absence d'objectif
est la raison la plus fr&eacute;quente des &eacute;checs sur internet.
Pour une raison simple &agrave; expliciter, d'ailleurs; Pas de buts, &ccedil;a
signifie pas de public. Facile &agrave; comprendre.</font>
<p><font color="#000099">Et de la m&ecirc;me fa&ccedil;on qu'on ne pr&eacute;pare
pas, &agrave; la t&eacute;l&eacute;vision, une &eacute;mission pour la
tranche d'&acirc;ge 5-7 ans comme un d&eacute;bat politique en direct,
on ne d&eacute;veloppe pas sur Internet un site destin&eacute; au public
senior comme un site cens&eacute; attirer les graphistes mordus de 3D.</font>
<br><font color="#000099">C'est certes le m&ecirc;me medium mais certainement
pas le m&ecirc;me message. Et si Marshall McLuhan avait raison ?</font>
<p><font color="#000099">&Ccedil;a signifie bien une chose en tout cas,
c'est que les objectifs professionnels de votre site et le public auquel
vous souhaitez vous adresser vont directement influencer le mode de d&eacute;veloppement
de votre site. Proposez un effet graphique flash macromedia qui exige un
plug-ins et 60 secondes de t&eacute;l&eacute;chargement &agrave; un public
senior serait une pure idiotie. De la m&ecirc;me fa&ccedil;on, pr&eacute;senter
une page graphiquement pauvre et sans technologie avanc&eacute;e &agrave;
une audience hi-tech serait une aberration.</font>
<p><b><font color="#000000">30 secondes pour convaincre</font></b>
<br><font color="#000099">Trop souvent, les d&eacute;veloppeurs HTML (le
langage en vigueur sur le web) ont tendance &agrave; travailler pour eux-m&ecirc;mes
ou pire, pour impressionner leurs confr&egrave;res au m&eacute;pris de
ce qui ferait correspondre un site &agrave; la cible recherch&eacute;e.</font>
<p><font color="#000099">Lorsqu'on s'appr&ecirc;te &agrave; recruter un
nouveau d&eacute;veloppeur pour <a href="http://www.referenceur.com/">SAM</a>,
la premi&egrave;re chose que nous cherchons &agrave; savoir n'est pas l'avancement
de ses connaissances techniques en Javascript, perl ou ActiveX mais plut&ocirc;t
quel site il aurait &eacute;t&eacute; le plus fier de d&eacute;velopper:
celui-ci
ou celui-l&agrave;. Et vous ?</font>
<p><font color="#000099">Cela revient-il &agrave; dire qu'un site pour
les seniors doit &ecirc;tre tristemen</font><font color="#000066">t sobre
(</font><font color="#000099">ou sobrement triste) ? Pas du tout, le visuel
est primordial sur Internet, et cela, quelque soit la cible. Mais il doit
&ecirc;tre simple d'acc&egrave;s, rapide en t&eacute;l&eacute;chargement
et surtout ais&eacute;ment compr&eacute;hensible et navigable.</font>
<p><font color="#000099">En combien de temps, un nouveau venu sur un site
internet d&eacute;cide-t-il s'il poursuivra sa visite ou non ? En 30 secondes,
montre en main. Si le code HTML de votre page avoisine les 40 Kilobytes
et vos logos et autres &eacute;l&eacute;ments visuels vont chercher dans
les 60 Kb (on ne compte pas des applets java &agrave; charger), oubliez
l'internet et faites de l'intranet.</font>
<p><font color="#000099">Attirer plus d'un visiteur par jour pr&ecirc;t
&agrave; t&eacute;l&eacute;charger 100 Kb pour un site qu'il ne conna&icirc;t
pas tiendrait du miracle absolu (ou de l'heureuse co&iuml;ncidence) . Les
seules exceptions connues &agrave; cette r&egrave;gle absolue &eacute;tant
les sites &agrave; caract&egrave;re pornographique &agrave; l'&eacute;gard
desquels le public masculin semble curieusement montrer une infinie patience.
Allez comprendre pourquoi ?</font></td>
</tr>
</table></center>
<P><BR></P>
<center><table BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=1 WIDTH="600" >
<tr>
<td ALIGN=LEFT VALIGN=TOP WIDTH="468"><b><i><font color="#000000"><font size=+1>2&egrave;me
partie:&nbsp;</font></font></i></b>
<br><b><font color="#000000">Le contenu d’un site, c’est &agrave; dire
l’information qu’il propose, est la cl&eacute; de son succ&egrave;s. Mais
comment le d&eacute;livrer gratuitement et, en m&ecirc;me temps, atteindre
vos objectifs commerciaux ?</font></b>
<p><img SRC="webquigagne.GIF" height=157 width=200 align=LEFT> <font color="#000099">Si
l’on demande &agrave; l’internaute moyen (et j’en suis un !) de juger un
site au hasard sur le web, le premier crit&egrave;re qu’il consid&egrave;rera,
inconsciemment ou non, sera &agrave; n’en point douter son aspect visuel
et sa pr&eacute;sentation graphique. &Ccedil;a doit &ecirc;tre clair, propre
et attrayant !</font>
<p><font color="#000099">A pr&eacute;sent, si l’on lui demande ce qui le
ferait revenir r&eacute;guli&egrave;rement sur un site, et donc d’en devenir
un fid&egrave;le disciple, il retiendra en priorit&eacute; un tout autre
aspect: le contenu, &agrave; savoir la fra&icirc;cheur et la pertinence
de l’information propos&eacute;e.</font>
<p><b><font color="#000000">Mais qu’est-ce qu’ils cherchent ?</font></b>
<br><font color="#000099">Un site qui gagne, ce sont donc trois composantes
fondamentales qui s’adressent chacune &agrave; une fraction de votre public.
Ceux qui n’ont jamais visit&eacute; votre site, les passants, appr&eacute;cieront
sa clart&eacute; et sa pr&eacute;sentation visuelle harmonieuse. Ceux qui
y reviennent une ou deux fois, les curieux, seront convaincus par la qualit&eacute;
du contenu que vous leur pr&eacute;sentez . Enfin, ceux qui sont d&eacute;j&agrave;
des habitu&eacute;s des lieux, les fid&egrave;les, vous t&eacute;moigneront
une infinie gratitude si, en plus, le t&eacute;l&eacute;chargement de vos
pages est rapide.</font>
<p><font color="#000099">La promotion intensive et le marketing actif de
votre site (qui ne rentrent pas &agrave; proprement parler dans le focus
de cet article) g&eacute;n&egrave;rent des passants, c’est &agrave; vous
et &agrave; vous seul qu’il appartient de les transformer en curieux, puis
en fid&egrave;les. C'est pourquoi le contenu, sp&eacute;cialement r&eacute;dactionnel,
de votre site rev&ecirc;t une importance majeure. C'est apr&egrave;s tout
la seule ressource cr&eacute;dible sur laquelle vous pouvez compter pour
atteindre les objectifs d&eacute;finis au d&eacute;part.</font>
<p><font color="#000099">Proposer un contenu de qualit&eacute;, c'est r&eacute;pondre
aussi cr&eacute;ativement que possible &agrave; une question basique: Quels
types d’informations les internautes que je cible esp&egrave;rent-ils trouver
lorsqu’ils arrivent sur le site ? Ne cherchez pas ailleurs le succ&egrave;s
sur internet. Une information pertinente, mise &agrave; jour, et d&eacute;livr&eacute;e
gratuitement. Point. A la ligne. Vous pouvez promouvoir du vide, vous pouvez
m&ecirc;me essayer d’en vendre mais une chose est s&ucirc;re; Vous ne le
vendrez qu’une fois !</font>
<p><font color="#000099">D&eacute;velopper un site qui gagne, c'est plus
pratiquement se mettre dans la peau de l’internaute que vous souhaitez
d&eacute;busquer sur le web et le faire dire: Mais pourquoi diable aurais-je
envie d’aller visiter ce site-l&agrave; ? Si, de bonne foi, vous trouvez
au moins une bonne raison, alors vous &ecirc;tes sur la bonne voie. Sinon
? Trouvez-la !</font>
<p><b><font color="#000000">C'est le d&eacute;tail qui compte</font></b>
<br><font color="#000099">Votre plus s&ucirc;r alli&eacute; en terme de
contenu, c'est l’espace dont vous disposez pour vous exprimez. Illimit&eacute;
! Sur internet, l’opportunit&eacute; vous est offerte d’aller dans le d&eacute;tail
et de ne pas vous limiter aux g&eacute;n&eacute;ralit&eacute;s d’usage
en vigueur sur tous les autres media. Faute de place. Le web vous offre
en outre un second luxe tout aussi appr&eacute;ciable, l’imm&eacute;diatet&eacute;
et la facilit&eacute; de diffusion. Songez un peu aux structures et au
budget n&eacute;cessaires pour imprimer un journal ou diffuser une &eacute;mission
de t&eacute;l&eacute;.</font>
<p><font color="#000099">Une chose est s&ucirc;re et ce, quel que soit
l’objet de votre site, les internautes esp&egrave;rent vous voir d&eacute;velopper
vos sujets en profondeur. Si vous leur racontez ce qu’ils savent d&eacute;j&agrave;
ou ce qu’ils peuvent trouver ailleurs, en plus d&eacute;taill&eacute;,
dites vous bien que l’int&eacute;r&ecirc;t que votre site repr&eacute;sente
est tout &agrave; fait relatif.</font>
<p><font color="#000099">Vos coll&egrave;gues et vos amis vous confirmeront
que votre site est sympa, mais vos visiteurs anonymes -- s'ils existent
-- vous feront passer un tout autre message. Il faut les comprendre. On
pr&eacute;tend aux nouveaux venus en ligne que le web est une encyclop&eacute;die
en temps r&eacute;el. C'est ce qu’ils attendent de vos services, c'est
ce qu’ils escomptent de chaque site auxquels ils consacrent du temps.</font>
<p><font color="#000099">D&eacute;cevoir une personne parce que vos services
ou vos informations ne sont pas assez techniques ou avanc&eacute;s, c'est
une chose. D'ailleurs vous ne pourrez jamais plaire &agrave; tout le monde.
Mais frustrer chacun de vos visiteurs pour les m&ecirc;mes raisons, c'est
un manque de comp&eacute;tence. Au niveau de l’image d’une entreprise,
pas de site du tout vaut sans doute mieux qu’un site de qualit&eacute;
m&eacute;diocre.</font>
<p><font color="#000099">C'est bien beau tout cela, mais o&ugrave; est
l’argent du web ? Ceux qui croient, parce qu’ils l’ont entendu, qu’il est
facile de g&eacute;n&eacute;rer du profit sur internet se trompent. C'est
h&eacute;las une triste v&eacute;rit&eacute;. En ligne, les seuls vrais
garants de votre succ&egrave;s sont la comp&eacute;tence, l’excellence,
la consistance et le travail.</font>
<p><font color="#000099">Non seulement vous devrez d&eacute;montrer des
qualit&eacute;s professionnelles irr&eacute;prochables aux visiteurs anonymes
que vous souhaitez convaincre. Vous devez en plus pr&eacute;senter un site
parfaitement entretenu au quotidien. Mais encore, vous devez travailler
dur et sans rel&acirc;che pour attirer l’hypoth&eacute;tique sponsor, l’improbable
annonceur ou le client miracle qui r&eacute;compensera d’un seul coup tous
vos efforts.</font>
<p><b><font color="#000000">G&eacute;n&eacute;rer des profits sur votre
site</font></b>
<br><font color="#000099">Mais l&agrave; encore, vous avez un autre alli&eacute;;
l’autopromotion... Dans cette zone de marketing absolu qu’est le cyber-espace,
personne ne vous en voudra d’accompagner les informations que vous publiez
gracieusement de quelques lignes &agrave; vocation publicitaire. Personne
ne vous en tiendra rigueur sauf si c'est fait grossi&egrave;rement, en
d&eacute;pit des r&egrave;gles de ce qu’on appelle la netiquette</font>
<p><font color="#000099">A ce propos, m&ecirc;me les internautes les plus
virulents, ceux qui d&eacute;fendent l’espace d’expression, d’&eacute;change
et de libre diffusion qu’&eacute;tait jadis internet, admettent qu’une
information utile puisse d&eacute;boucher sur une offre commerciale. Ne
soyons pas trop na&iuml;fs, si rien n’&eacute;tait commercial sur le web,
internet en serait sans doute encore &agrave; l’&eacute;tat d’exp&eacute;rimentation
universitaire.</font>
<p><font color="#000099">Cela signifie-t-il que toute information d&eacute;livr&eacute;e
doit &ecirc;tre publi-r&eacute;dactionnelle ? Non, bien s&ucirc;r, il vous
appartient de savamment doser entre ce qui est information publicitaire
et publicit&eacute; informative. La meilleure promotion, vous ne tarderez
sans doute pas &agrave; le constater, c'est celle que vos visiteurs feront
pour vous. Les strat&egrave;ges du marketing sont au moins d’accord sur
un point, la meilleure formule publicitaire qu’on ait jamais invent&eacute;,
c'est le bouche-&agrave;-oreille.</font>
<p><font color="#000099">L&agrave; se situe sans nul doute votre vraie
opportunit&eacute; commerciale. Soyez-en bien conscient. La qualit&eacute;
des informations que vous proposerez et l’excellence professionnelle que
vous d&eacute;montrerez &agrave; travers votre site internet constituent,
au final, bien plus qu’une carte de visite ou une brochure en couleurs.</font>
<p><font color="#000099">C'est une preuve absolue de comp&eacute;tence
que vos visiteurs ne vous discuteront pas. Outre le fait d’engendrer l’adh&eacute;sion
de vos visiteurs, vous susciterez chez eux un sentiment de confiance. Comp&eacute;tence
et confiance, sur Internet comme ailleurs, &ccedil;a signifie business.</font></td>
</tr>
</table></center>
<P><BR></P>
<center><table BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=1 WIDTH="600" >
<tr>
<td ALIGN=LEFT VALIGN=TOP WIDTH="468"><b><i><font color="#000000"><font size=+1>3&egrave;me
partie:&nbsp;</font></font></i></b>
<br><b>Le positionnement strat&eacute;gique de votre site et la r&eacute;putation
professionnelle que vous allez construire jour apr&egrave;s jour, vont
directement influencer les r&eacute;sultats commerciaux li&eacute;s &agrave;
votre pr&eacute;sence en ligne.</b>
<p><img SRC="flechette.GIF" height=157 width=200 align=LEFT><font color="#000099">Au
vu de la vitesse &agrave; laquelle &eacute;volue internet, il n'est sans
doute plus envisageable aujourd'hui d'arriver le premier sur un cr&eacute;neau
commercial quel qu'il soit. Or rien n'est plus dramatique que d'&ecirc;tre
fondu dans la masse n&eacute;buleuse du cyber-espace. Etre un site parmi
tant d'autres, c'est d&eacute;j&agrave; une forme de renonciation au succ&egrave;s.</font>
<p><font color="#000099">Vendre des fleurs sur le web en 1998, alors que
tout le monde le fait d&eacute;j&agrave; depuis des lustres, &ccedil;a
devient presque grotesque. Il faut offrir un avantage v&eacute;ritable,
proposer un produit unique, &ecirc;tre ais&eacute;ment identifiable par
les internautes. C'est exactement l'objet du positionnement d'un site internet.</font>
<p><b>Un gros poisson dans un petit bocal ?</b>
<p><font color="#000099">On constate par exemple qu'ouvrir une librairie
virtuelle lorsque le march&eacute; est d&eacute;j&agrave; occup&eacute;
de pied ferme par des marques prestigieuses et des entreprises financi&egrave;rement
solides comme la <a href="http://www.fnac.fr/">FNAC</a> ou <a href="http://www.alapage.com/">Alapage</a>,
est un pari presque perdu d'avance. Alors, faut-il renoncer pour autant
&agrave; vendre des livres sur le net.&nbsp;</font>
<p><font color="#000099">Sans doute pas. Mais il faut sans doute se positionner
sur le march&eacute; d'une mani&egrave;re plus cr&eacute;ative en proposant
(pourquoi pas ?) une librairie virtuelle sp&eacute;cialis&eacute;e dans
la science-fiction ou dans les recettes de cuisine picardes. Le march&eacute;
appara&icirc;t sans doute beaucoup moins ouvert mais la comp&eacute;tition
est assur&eacute;ment plus facile &agrave; g&eacute;rer et la cible, beaucoup
mieux identifiable.</font>
<p><font color="#000099">L'avantage, lorsqu'on planifie le positionnement
de son entreprise virtuelle, c'est de b&eacute;n&eacute;ficier des &eacute;tapes
pr&eacute;alables qui ont d&eacute;j&agrave; permis de clarifier les objectifs
commerciaux et de mieux cibler les clients potentiels.&nbsp;</font>
<p><font color="#000099">A partir de l&agrave;, vous pouvez toujours, en
lorgnant sur les sites de vos concurrents, d&eacute;terminer quels sont
vos avantages et surtout vos faiblesses. Vous pouvez m&ecirc;me - c'est
vivement conseill&eacute; -- essayer de r&eacute;pondre &agrave; une question
tr&egrave;s utile: "pourquoi quelqu'un ach&egrave;terait-il les produits
- ou paierait-il pour les services - propos&eacute;s sur mon site plut&ocirc;t
que d'aller voir ailleurs sur le web ?"</font>
<p><b>Valeur ajout&eacute;e&nbsp;</b>
<p><font color="#000099">Le succ&egrave;s de certains sites am&eacute;ricains
de commerce &eacute;lectronique comme <a href="http://www.amazon.com/">Amazon.com</a>
, <a href="http://www.gap.com/">Gap</a> ou <a href="http://www.travelocity.com/">Travelocity</a>,
nous a beaucoup appris sur les motivations r&eacute;elles des "consommateurs"
virtuels. Et &eacute;videmment, de ces aspirations &eacute;nonc&eacute;es
par ceux qui ach&egrave;tent vraiment sur Internet sont n&eacute;es des
th&eacute;ories sur les crit&egrave;res qui incitent l'internaute &agrave;
cliquer sur le bouton "commande".&nbsp;</font>
<p><font color="#000099">Que vous proposiez des services ou que vous vendiez
des produits ne change pas fonci&egrave;rement la nature du probl&egrave;me.
Pour r&eacute;ussir d'un point de vue commercial, votre site doit pr&eacute;senter
au minimum deux des avantages suivants:&nbsp;</font>
<ul>
<li>
<font color="#000099">Des prix plus bas; c'est g&eacute;n&eacute;ralement
une constante sur Internet. Le contexte &eacute;conomique du cyber-espace
permet de proposer les m&ecirc;mes produits que dans la r&eacute;alit&eacute;
&agrave; un tarif plus avantageux pour le consommateur.&nbsp;</font></li>

<li>
<font color="#000099">Une s&eacute;lection plus large; Le but &eacute;tant
de conserver vos clients potentiels le plus longtemps possible &agrave;
l'int&eacute;rieur de votre site, plus vous lui proposerez de choix, plus
il aura l'occasion d'y rester.&nbsp;</font></li>

<li>
<font color="#000099">Un meilleur service &agrave; la client&egrave;le;
Vous pouvez d&eacute;velopper les fonctions interactives de votre site
et, en m&ecirc;me temps, pr&eacute;parer le service client&egrave;le &agrave;
g&eacute;rer les correspondances &eacute;lectroniques d'une mani&egrave;re
efficace.&nbsp;</font></li>

<li>
<font color="#000099">Des services sp&eacute;ciaux; Un site qui vous rappelle
par email la date d'anniversaire de votre belle-m&egrave;re, voil&agrave;
une initiative sympathique.&nbsp;</font></li>

<li>
<font color="#000099">Un c&ocirc;t&eacute; pratique; Bon nombre de gens
n'aiment pas perdre leur temps le samedi apr&egrave;s-midi dans les magasins
de bricolage ou les supermarch&eacute;s. Pour ceux-l&agrave;, vos offres
pourront s'av&eacute;rer attrayantes.&nbsp;</font></li>

<li>
<font color="#000099">De meilleurs d&eacute;lais de livraison: Si vous
vendez du "contenu" t&eacute;l&eacute;chargeable imm&eacute;diatement,
c'est une &eacute;vidence. Mais si vous livrez vos produits en 48 heures
n'importe o&ugrave; en Europe, vous aurez des clients aussi.</font></li>
</ul>
<b>Perfectionnisme et cr&eacute;dibilit&eacute;</b>
<p><font color="#000099">L'autre moyen de se positionner efficacement sur
le web est de pr&eacute;senter le produit parfait, le site qui gagne...
C'est bien de cela qu'on parle ? L'internet, qui demeure essentiellement
(et pour quelques temps encore) un support largement textuel, exige un
effort constant et une attention particuli&egrave;re sur le plan de la
r&eacute;daction et au niveau de la logique de pr&eacute;sentation.</font>
<p><font color="#000099">En consacrant du temps &agrave; r&eacute;diger
les textes qui figureront sur votre site, &agrave; les mettre en page et
en rafra&icirc;chissant r&eacute;guli&egrave;rement votre sommaire, vous
b&acirc;tissez votre cr&eacute;dibilit&eacute; et votre r&eacute;putation.
Sans ces deux armes-l&agrave;, difficile d'envisager de remplir son carnet
de commandes. Vous aurez beau proposer un produit r&eacute;volutionnaire
&agrave; un prix ridiculement bas, sans cr&eacute;dibilit&eacute;, vous
ne g&eacute;n&eacute;rerez jamais la confiance du public. En un mot, vous
n'aurez pas de client.&nbsp;</font>
<p><font color="#000099">D'autres exemples ? Si votre logo parait approximatif
ou si l'url de votre site est un sous-r&eacute;pertoire d'un site plus
important (http://www.chez.com/dupont-sarl/), vos visiteurs auront le sentiment
que votre entreprise n'est pas professionnelle. Tout indice d'amateurisme
sur un site internet suffira &agrave; &eacute;loigner d'&eacute;ventuels
visiteurs de l'id&eacute;e de conclure un jour une affaire avec vous.&nbsp;</font>
<p><font color="#000099">Communiquer sur les terrains de la cr&eacute;dibilit&eacute;
et de la r&eacute;putation est une v&eacute;ritable science. Et tout ce
qui a un rapport proche ou lointain avec le marketing de votre pr&eacute;sence
&eacute;lectronique, de la pr&eacute;sentation de vos emails &agrave; la
qualit&eacute; de votre lettre d'information, influence directement la
r&eacute;putation de votre entreprise ! Selon le soin que vous apportez
&agrave; vos messages, l'influence sera positive ou n&eacute;gative. Mais
&ccedil;a, c'est vous qui d&eacute;cidez.&nbsp;</font></td>
</tr>
</table></center>
<P><BR></P>
<center><table BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=1 WIDTH="600" >
<tr>
<td ALIGN=LEFT VALIGN=TOP WIDTH="468"><b><i><font color="#000000"><font size=+1>4&egrave;me
partie:&nbsp;</font></font></i></b>
<br><b>Contrairement &agrave; des id&eacute;es largement diffus&eacute;es,
"multimedia" ne signifie pas uniquement textes, sons et images anim&eacute;es.
La fonction la plus importante sur le web, celle qu'un site qui gagne doit
fondamentalement mettre en avant, c'est l'interactivit&eacute;.</b>
<p><img SRC="victoire.GIF" height=157 width=200 align=LEFT><font color="#000099">Parmi
les premiers r&eacute;sultats effectifs que votre site, convenablement
promotionn&eacute; et subtilement "market&eacute;", saura g&eacute;n&eacute;rer,
les messages par email adress&eacute;s par des visiteurs curieux et des
webmestres entreprenants se r&eacute;v&eacute;leront sans doute les plus
nombreux.&nbsp;</font>
<p><font color="#000099">Un postulat de d&eacute;part; publier sur le net,
c'est en premier lieu communiquer. Et comme c'est la r&egrave;gle du jeu,
vous allez donc par le biais de votre site flambant neuf rentrer en contact
avec une foule d'internautes anonymes et qui ne doivent pas le rester.</font>
<p><font color="#000099">Le net est devenu le premier medium de masse qui
privil&eacute;gie l'&eacute;change particulier. Ils seront cent &agrave;
visiter votre site mais seulement deux ou trois &agrave; chercher &agrave;
entrer en contact direct avec vous. Et si ces deux ou trois l&agrave; &eacute;taient
justement ceux qui permettront &agrave; votre business de se d&eacute;velopper
?</font>
<p><font color="#000099">Pour dire la v&eacute;rit&eacute;, dans la majeure
partie des cas, ce sont bien eux (et eux seuls) les pivots de votre commerce
virtuel dans le monde r&eacute;el, celui de la monnaie sonnante et tr&eacute;buchante.
A moins que vous ne d&eacute;veloppiez un site "de marque" et que vos produits
soient disponibles chez les commer&ccedil;ants du quartier, votre &eacute;talage
&agrave; vous, c'est le web.</font>
<p><font color="#000099">Et ceux qui signalent leur visite (ou leur existence)
en vous adressant un message, sont les consommateurs que le fromager du
march&eacute; dominical voit passer devant son stand. Ce bienheureux vendeur
a la possibilit&eacute; d'attirer l'attention des passants en scandant:
"Bonjour ma bonne dame. J'ai un superbe cantal jeune, je vous en mets 500
grammes ?"</font>
<p><font color="#000099">Il a tout int&eacute;r&ecirc;t &agrave; signaler
sa pr&eacute;sence, communiquer la qualit&eacute; de son produit et susciter
des r&eacute;actions de la part de ceux qui d&eacute;filent devant son
&eacute;tale. Sinon, tous ces aimables clients potentiels iront lorgner
sur le stand de l'autre marchand fromage install&eacute; un peu plus loin
dans l'all&eacute;e ou sur celui du cr&eacute;mier. Le web, par nature,
n'est pas fonci&egrave;rement diff&eacute;rent. L'en jeu v&eacute;ritable,
c'est de susciter des r&eacute;actions.</font>
<p><b><font color="#000000">Communaut&eacute; et interactivit&eacute;</font></b>
<p><font color="#000099">Toute la philosophie du web, lorsqu'on l'analyse
un petit peu, est bas&eacute; sur la notion d'interactivit&eacute;. Interactivit&eacute;
entre les pages du site elles-m&ecirc;mes, interactivit&eacute; entre votre
site et tous les autres pr&eacute;sents sur le web, interactivit&eacute;
entre le web et le reste des outils disponibles sur Internet (qu'il s'agisse
des moteurs de recherche, des emails, des listes de diffusion, des fichiers
FTP, etc), Interactivit&eacute;, enfin, entre vos visiteurs et vous !</font>
<p><font color="#000099">Avant de penser &agrave; d&eacute;velopper des
relations commerciales avec la masse diffuse des internautes qui, dans
l'anonymat, vous rendent visite, il vous faut consacrer du temps &agrave;
&eacute;tablir des relations personnelles et particuli&egrave;res avec
certains d'entre eux.</font>
<p><font color="#000099">Des relations par email qui s'av&egrave;rent souvent
instructives et qu'il vous faudra non seulement initier, mais surtout entretenir
et rendre commerciale. Pour exister et se d&eacute;velopper, un site qu'il
soit commercial ou non, doit &ecirc;tre en mesure de trouver son public,
ce qu'on appelle sur la toile, sa communaut&eacute; d'utilisateurs.</font>
<p><font color="#000099">L'id&eacute;e consiste donc &agrave; donner &agrave;
chacun de vos visiteurs le maximum d'opportunit&eacute;s de rentrer en
contact avec vous. D'abord en leur rendant la t&acirc;che ais&eacute;e.
Il faut utiliser &agrave; la fois des adresses email cliquables d'apparence
informelles et des formulaires (scripts) &agrave; caract&egrave;re plus
"officiels". Selon les motivations des internautes, cette option se r&eacute;v&egrave;lera
plus ou moins utile.&nbsp;</font>
<p><font color="#000099">Ensuite en multipliant ces liens sur l'ensemble
de vos pages. Juste pour &ecirc;tre certain que celui qui souhaite vous
adresser un message soit toujours en mesure de le faire. Enfin en donnant
d'excellentes raisons &agrave; vos visiteurs de vous contacter; la meilleure
est sans doute la lettre d'information p&eacute;riodique mais, &agrave;
d&eacute;faut, une annonce transmise &agrave; chaque fois que le site est
mis &agrave; jour fera tr&egrave;s bien l'affaire.</font>
<p><b><font color="#000000">L'art de se lier</font></b>
<p><font color="#000099">D&eacute;velopper le potentiel interactif de votre
site, c'est &agrave; la fois oeuvrer &agrave; la cr&eacute;ation d'une
communaut&eacute;, multiplier les opportunit&eacute;s promotionnelles et
pr&eacute;parer le terrain commercial. Un webmestre digne de ce nom doit
imp&eacute;rativement consid&eacute;rer les trois sur un pied d'&eacute;galit&eacute;.&nbsp;</font>
<p><font color="#000099">Tandis que dans la r&eacute;alit&eacute;, la comp&eacute;tition
commerciale et la concurrence sont g&eacute;n&eacute;ralement n&eacute;cessaires
et profitables au consommateur, sur le web, c'est un peu diff&eacute;rent.
Le partenariat et la collaboration (avec d'autres sites) sont des arguments
promotionnels et m&ecirc;me commerciaux avec lesquels il faut compter.</font>
<p><font color="#000099">Imaginez votre site comme le membre d'une association
locale de commer&ccedil;ants. Lorsque chacun reste dans son coin, difficile
de cr&eacute;er l'&eacute;v&eacute;nement. En revanche, s'ils joignent
leurs efforts, unissent leurs ressources et rassemblent leurs clients autour
de l'id&eacute;e d'une quinzaine commerciale dans le quartier, tout le
monde - m&ecirc;me les clients ! - y trouvera son compte.&nbsp;</font>
<p><font color="#000099">Suivant ce concept, un site qui cible votre public
mais ne propose pas exactement le m&ecirc;me service doit devenir un alli&eacute;.
Par exemple, pour Sam magazine qui se propose de donner des conseils en
promotion et r&eacute;f&eacute;rencement de sites, les sites id&eacute;aux
&agrave; contacter pour monter des &eacute;changes et des partenariats
sont ceux qui s'adressent directement aux webmestres; les banques de donn&eacute;es
d'images, les services de t&eacute;l&eacute;chargement de logiciels, les
moteurs de recherche, etc.&nbsp;</font>
<p><font color="#000099">Si votre site para&icirc;t solide, si son contenu
pr&eacute;sente de l'int&eacute;r&ecirc;t et si vous encouragez les visiteurs
&agrave; prendre contact avec vous, vous ne tarderez pas &agrave; faire
l'objet de demandes d'&eacute;changes de liens ou de bandeaux. A chaque
fois que l'occasion se pr&eacute;sente, qu'un webmestre vous propose un
partenariat ou que vous m&ecirc;me, cherchez &agrave; &eacute;changer un
lien avec un autre site, quelques questions pr&eacute;alables m&eacute;ritent
d'&ecirc;tre &eacute;claircies.&nbsp;</font>
<p><b><font color="#000000">Cherche partenaire d&eacute;sesp&eacute;r&eacute;ment.</font></b>
<p><font color="#000099">Chaque lien doit pr&eacute;senter au moins un
avantage &agrave; votre niveau et &agrave; celui du site consid&eacute;r&eacute;.
Les bons &eacute;changes et les partenariats qui durent, c'est lorsque
tout le monde y gagne !&nbsp;</font>
<p><font color="#000099">Ainsi certains liens repr&eacute;senteront une
ressource suppl&eacute;mentaire pour vos visiteurs (valeur de l'information).
D'autres permettront &agrave; votre site de gagner de la visibilit&eacute;
(image de marque). D'autres encore vous permettront d'&eacute;largir la
communaut&eacute; d'utilisateurs de votre site (partenariat contenu). D'autres
enfin vous permettront d'augmenter purement et simplement le nombre de
visites sur votre site (&eacute;change de trafic).</font>
<p><font color="#000099">Ne r&ecirc;vez pas cependant, les sites qui deviendront
vos partenaires virtuels ne vous apporteront le plus souvent que l'un de
ces arguments, pas les quatre &agrave; la fois. L'exemple le plus r&eacute;ussi
en mati&egrave;re de partenariat promo-commercial, historiquement parlant,
est certainement l'association entre le plus c&eacute;l&egrave;bre annuaire
du monde, Yahoo.com et le leader des libraires virtuels, Amazon.com.&nbsp;</font>
<p><font color="#000099">Amazon gagne sur tous les tableaux; image de marque,
trafic, &eacute;largissement de la communaut&eacute;. En outre, il propose
aux utilisateurs de Yahoo une information de qualit&eacute; - tous les
livres parus sur un sujet pr&eacute;cis - et &agrave; la soci&eacute;t&eacute;
qui g&egrave;re Yahoo, une commission substantielle sur chaque vente g&eacute;n&eacute;r&eacute;e.&nbsp;</font>
<p><font color="#000099">Pas de faille apparente dans ce contrat-l&agrave;.
Je vends de la p&acirc;te-&agrave;-modeler virtuelle. Peut-&ecirc;tre que
moi aussi je peux vous proposer un deal, Monsieur Yahoo ?&nbsp;</font></td>
</tr>
</table></center>

<center>
<p><img SRC="trait_80GIF.GIF" height=3 width=300>
<br><b><font size=-2>(c) 1998, 1999 Euro-SAM (soci&eacute;t&eacute; Acorus)</font></b>
<br><font size=-2>141, avenue Montaigne - 33160 Saint M&eacute;dard en
Jalles - FRANCE</font>
<br><font size=-2>T&eacute;l.: 33 (0)5 56 70 89 33 - Fax: 33 (0)5 56 70
07 02 - Email: <a href="mailto:contact@sam-mag.com">contact@sam-mag.com</a></font></center>

</body>

<!-- Mirrored from www.ccim.be/ccim328/archi/sources/site_qui_tue.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:38:54 GMT -->
</html>
