<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<!-- Mirrored from www.ccim.be/ccim328/archi/contenu.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:08 GMT -->
<HEAD>
<TITLE>Architecture d'un site Web - Lignes de force - Sch&eacute;ma global</TITLE>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
<META HTTP-EQUIV="Content-language" CONTENT="fr">
<META NAME="Author" CONTENT="Van Lancker Luc">
<META NAME="Description" CONTENT="Architecture d'un site Web - Réflexions et stratégies pour la conception et l'organisation d'un site Web.">
<META NAME="KeyWords" CONTENT="webdesign,webdesigner,web design,site,page,developer,dévelopement,dévelopement site,guide,webguide,site web,site internet,création site,conception site,webmaster,webmestre,webstyle,tutorial,didacticiel,html,télécharger,download">
<META NAME="rating" CONTENT="General">
<META NAME="Copyright" CONTENT="Copyright 1999 © Van Lancker Luc">
<META NAME="Identifier-URL" CONTENT="../index.html">
<META NAME="Reply-to" CONTENT="Vanlancker.Luc@ccim.be">
<META NAME="Category" CONTENT="Internet">
<META NAME="robots" CONTENT="index, follow">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#000080" VLINK="#551A8B" ALINK="#FF0000" BACKGROUND="BGPAGE.gif">

<TABLE WIDTH="600" >
<TR>
<TD><FONT COLOR="#000080"><FONT SIZE=-1>&nbsp;&nbsp;Lignes de force</FONT></FONT>

<TABLE WIDTH="100%" >
<TR VALIGN=TOP>
<TD WIDTH="80%"><B><FONT COLOR="#000080"><FONT SIZE=+3>Contenu r&eacute;dactionnel</FONT></FONT></B></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="public.htm"><IMG SRC="ARROWUP.gif" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="visuel.htm"><IMG SRC="ARROWDOW.gif" ALT="Down" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>
</TABLE>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="15"><IMG SRC="../../../localhost/E_/Monsite/archi/VIDE.gif" HEIGHT=12 WIDTH=12></TD>

<TD WIDTH="420"><B><FONT COLOR="#000080"><I>Le Web est par essence textuel.</I>
</FONT></B>
<P>Le Web est une formidable source d'informations. Mais &agrave; la diff&eacute;rence
de la t&eacute;l&eacute;vision par exemple, l'internaute doit adopter une
d&eacute;marche active car il doit aller chercher cette information. Dans
cette recherche, il s'attend &agrave; trouver de l'information utile et
un contenu pertinent et actualis&eacute;. Dans le cas contraire, l'internaute
s'en ira frustr&eacute; et on peut parier qu'il ne remettra jamais les
pieds dans votre site. </P>
</TD>

<TD WIDTH="165">
<CENTER><P><IMG SRC="TABCON.gif" HEIGHT=120 WIDTH=160></P></CENTER>
</TD>
</TR>
</TABLE>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="1%"><IMG SRC="VIDE.gif" HEIGHT=12 WIDTH=12></TD>

<TD>N'oubliez pas non plus que le Web est un march&eacute; tr&egrave;s
concurrenc&eacute; et que la plupart des sujets d’informations sont ou
seront trait&eacute;s &agrave; de multiples reprises. La diff&eacute;rence
se fera sur la qualit&eacute; et le d&eacute;tail du contenu. 
<P>L'internaute moyen apr&egrave;s avoir longuement vagabond&eacute; dans
tous les sens sur la toile, se limite tr&egrave;s souvent, apr&egrave;s
quelques mois, &agrave; une vingtaine de sites qui correspondent &agrave;
ses centres d'int&eacute;r&ecirc;t et qu'il revisite &agrave; intervalle
r&eacute;gulier. Ces sites ainsi &quot;&eacute;lus&quot; le sont non pas
pour le graphisme puisqu'il le conna&icirc;t par cœur et ne le regarde
m&ecirc;me plus, non pas pour la facilit&eacute; de navigation puisqu'il
l’oublie tellement il y est &agrave; l'aise, mais pour le contenu et surtout
son actualisation r&eacute;guli&egrave;re. Le contenu est le meilleur moyen
pour fid&eacute;liser votre public. Faire venir le visiteur sur votre site,
c'est bien, le faire revenir c’est assur&eacute;ment la plus belle r&eacute;ussite.</P>

<P>Par exp&eacute;rience, on remarque que ce n'est pas tant ceux qui n'ont
rien &agrave; dire qui n'h&eacute;sitent pas &agrave; publier sur le Web
mais ceux qui, comp&eacute;tent dans une sph&egrave;re d'activit&eacute;,
veulent &agrave; tout prix viser l'excellence. Le Web est large et les
publics vari&eacute;s. De la vulgarisation &agrave; l'expertise, chaque
niveau a sa place pourvu que le sujet soit trait&eacute; de fa&ccedil;on
coh&eacute;rente. Il est parfois plaisant d'avoir une explication claire
et simple sur un sujet d&eacute;termin&eacute; sans devoir entrer dans
des d&eacute;veloppements pointus mais compliqu&eacute;s. Rien n'emp&ecirc;che
alors de pr&eacute;ciser d’entr&eacute;e les limites de votre site. </P>

<P>Bien que l'auteur ne soit pas un champion en la mati&egrave;re, des
fautes d'orthographe &quot;&eacute;naurmes et trop nombreuse&quot; non
seulement agacent votre lecteur mais surtout d&eacute;pr&eacute;cient la
cr&eacute;dibilit&eacute; de votre contenu et l'image de votre site. De
gr&acirc;ce, il existe des correcteurs d'orthographe et des bons samaritains
de la langue fran&ccedil;aise pour vous relire ! <FONT SIZE=-1>[promis,
je ferai des efforts...] </FONT></P>
</TD>
</TR>
</TABLE>

<P><BR>
</P>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD COLSPAN="2">
<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>

<TR VALIGN=TOP>
<TD ALIGN=LEFT WIDTH="80%"></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="public.htm"><IMG SRC="ARROWUP.gif" ALT="Up" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="visuel.htm"><IMG SRC="ARROWDOW.gif" ALT="Down" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

</BODY>

<!-- Mirrored from www.ccim.be/ccim328/archi/contenu.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:08 GMT -->
</HTML>
