<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<!-- Mirrored from www.ccim.be/ccim328/archi/decoupe.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:09 GMT -->
<HEAD>
<TITLE>Architecture d'un site Web - D&eacute;coupe de l'information en pages</TITLE>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
<META HTTP-EQUIV="Content-language" CONTENT="fr">
<META NAME="Author" CONTENT="Van Lancker Luc">
<META NAME="Description" CONTENT="Architecture d'un site Web - Réflexions et stratégies pour la conception et l'organisation d'un site Web.">
<META NAME="KeyWords" CONTENT="webdesign,webdesigner,web design,site,page,developer,dévelopement,dévelopement site,guide,webguide,site web,site internet,création site,conception site,webmaster,webmestre,webstyle,tutorial,didacticiel,html,télécharger,download">
<META NAME="rating" CONTENT="General">
<META NAME="Copyright" CONTENT="Copyright 1999 © Van Lancker Luc">
<META NAME="Identifier-URL" CONTENT="../index.html">
<META NAME="Reply-to" CONTENT="Vanlancker.Luc@ccim.be">
<META NAME="Category" CONTENT="Internet">
<META NAME="robots" CONTENT="index, follow">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#000080" VLINK="#551A8B" ALINK="#FF0000" BACKGROUND="BGPAGE.gif">

<TABLE WIDTH="600" >
<TR>
<TD><FONT COLOR="#000080"><FONT SIZE=-1>&nbsp;&nbsp;Architecture</FONT>
d'un site </FONT>
<TABLE WIDTH="100%" >
<TR VALIGN=TOP>
<TD WIDTH="80%"><B><FONT COLOR="#000080"><FONT SIZE=+3>D&eacute;coupe de
l'information</FONT></FONT></B></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="fonction.htm"><IMG SRC="ARROWUP.gif" ALT="Up" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="structure.htm"><IMG SRC="ARROWDOW.gif" ALT="down" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>
</TABLE>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD><B><I><FONT COLOR="#000080">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Au royaume de l'hypertexte, la page est
reine.</FONT></I></B></TD>
</TR>
</TABLE>

&nbsp;


<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="1%"><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>Raisons</FONT></FONT> 
<P>La raison essentielle de la d&eacute;coupe du contenu en petites pages
de dimension r&eacute;duite r&eacute;side dans un temps de chargement raisonnable
pour le confort de l’internaute. Et n'oubliez pas que ce fameux temps de
chargement comprend non seulement le texte de la page mais aussi les images
voire autres animations du style Java, Javascript ou Dhtml. Avec un total
de 45 ko, vous serez dans une zone id&eacute;ale tandis qu’une page de
70 &agrave; 80 ko est &agrave; consid&eacute;rer comme un maximum pour
un temps de chargement acceptable.</P>

<P>Des petits morceaux d'information sont plus adapt&eacute;s &agrave;
la lecture sur un &eacute;cran d'ordinateur que la vision partielle d'un
long document. La m&eacute;moire imm&eacute;diate et la synth&egrave;se
instantan&eacute;e de l'esprit humain &eacute;tant ce qu'elles sont, des
pages Web tr&egrave;s longues sont d&eacute;stabilisantes car elles n&eacute;cessitent
le d&eacute;filement vertical et l'obligation de se rappeler les informations
ainsi disparues de l'&eacute;cran. Selon certaines &eacute;tudes psychologiques,
la m&eacute;moire &agrave; court terme comprend entre 4 ou 7 petits &eacute;l&eacute;ments
d'information. </P>

<P>En outre, cette d&eacute;coupe de l'information en petites unit&eacute;s
logiques, associ&eacute;e &agrave; une structure rationnelle, facilite
grandement la navigation et la recherche de l'information souhait&eacute;e.</P>

<P>Pour fixer un ordre de grandeur, cette d&eacute;coupe de l'information
correspondra &agrave; 2 ou 3 &eacute;crans soit environ 1/2 &agrave; 1
feuille A4 sans mise en forme ou alors 2 &agrave; 3 feuilles A4 d'une mise
en page particuli&egrave;rement a&eacute;r&eacute;e.</P>

<CENTER><P><IMG SRC="ECRAN.gif" HEIGHT=92 WIDTH=67></P></CENTER>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220><BR>
&nbsp;</P></CENTER>
</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>Utilit&eacute;</FONT></FONT> 
<P>Le d&eacute;coupage de l'information en petits morceaux, organis&eacute;s
de fa&ccedil;on uniforme est particuli&egrave;rement adapt&eacute; aux
pr&eacute;sentations Web car : </P>

<TABLE WIDTH="100%" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="1%"><IMG SRC="BUTT.gif" VSPACE=3 HEIGHT=13 WIDTH=11></TD>

<TD>peu d'utilisateurs passeront leur temps &agrave; lire de longs passages
de texte sur l'&eacute;cran. A la lecture en ligne, on pr&eacute;f&eacute;rera
souvent enregistrer les longs documents ou m&ecirc;me les imprimer.</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="BUTT.gif" VSPACE=3 HEIGHT=13 WIDTH=11></TD>

<TD>le d&eacute;coupage de l'information en petites unit&eacute;s et le
syst&egrave;me hypertexte font bon m&eacute;nage. En effet, en cliquant
sur un lien, l’internaute s'attend g&eacute;n&eacute;ralement &agrave;
trouver un autre morceau d'information li&eacute;e et compl&eacute;mentaire
&agrave; la pr&eacute;c&eacute;dente et non un livre complet. Mais ne subdivisez
pas trop votre information. Cliquer un lien pour ne trouver que quelques
mots ou un petit paragraphe peut se r&eacute;v&eacute;ler frustrant pour
l’utilisateur et le distraire du v&eacute;ritable contenu. On utilisera
alors plut&ocirc;t (mais sans en abuser) les petites fen&ecirc;tres pop-up
du Javascript.</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="BUTT.gif" VSPACE=3 HEIGHT=13 WIDTH=11></TD>

<TD>une forme uniformis&eacute;e du d&eacute;coupage et de la pr&eacute;sentation
cr&eacute;e une identit&eacute; &agrave; votre site. Cette coh&eacute;rence
permettra tr&egrave;s vite &agrave; vos visiteurs d'acqu&eacute;rir une
certaines exp&eacute;rience pour leurs recherches et autres explorations,
voire m&ecirc;me de pr&eacute;voir comment une nouvelle section de votre
site sera organis&eacute;e. Vous aurez alors cr&eacute;&eacute; &quot;un
site o&ugrave; on se sent &agrave; l'aise&quot;, ce qui est une des cl&eacute;s
essentielles d'un bon site.</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="BUTT.gif" VSPACE=3 HEIGHT=13 WIDTH=11></TD>

<TD>l'essence de la navigation sur le World Wide Web n'est-elle pas l'acquisition
d'un savoir &agrave; partir de multiples morceaux d'information acquis
de fa&ccedil;on non s&eacute;quentielle ? </TD>
</TR>
</TABLE>

<P>Ce concept de d&eacute;coupage de l'information doit cependant &ecirc;tre
flexible et adapt&eacute; au sujet trait&eacute; ainsi qu’&agrave; la logique
d'organisation de votre site et au confort de votre visiteur. C'est la
nature du contenu qui sugg&eacute;rera le meilleur moyen de subdiviser
et d'organiser l'information. Ainsi, dans certains cas, des pages plus
longues seront n&eacute;anmoins n&eacute;cessaires pour traiter compl&egrave;tement
un sujet sans distraire le visiteur par une d&eacute;coupe intempestive
de celui-ci. C'est particuli&egrave;rement vrai lorsque l'on souhaite que
l'utilisateur puisse imprimer ou enregistrer un sujet d&eacute;termin&eacute;
en une seule &eacute;tape. </P>
</TD>
</TR>
</TABLE>

<P><BR>
</P>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD COLSPAN="2">
<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>

<TR VALIGN=TOP>
<TD ALIGN=LEFT WIDTH="80%"></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="fonction.htm"><IMG SRC="ARROWUP.gif" ALT="Up" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="structure.htm"><IMG SRC="ARROWDOW.gif" ALT="Down" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

</BODY>

<!-- Mirrored from www.ccim.be/ccim328/archi/decoupe.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:09 GMT -->
</HTML>
