<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<!-- Mirrored from www.ccim.be/ccim328/archi/fonction.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:09 GMT -->
<HEAD>
<TITLE>Architecture d'un site Web - Lignes de force - Sch&eacute;ma global</TITLE>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
<META HTTP-EQUIV="Content-language" CONTENT="fr">
<META NAME="Author" CONTENT="Van Lancker Luc">
<META NAME="Description" CONTENT="Architecture d'un site Web - Réflexions et stratégies pour la conception et l'organisation d'un site Web.">
<META NAME="KeyWords" CONTENT="webdesign,webdesigner,web design,site,page,developer,dévelopement,dévelopement site,guide,webguide,site web,site internet,création site,conception site,webmaster,webmestre,webstyle,tutorial,didacticiel,html,télécharger,download">
<META NAME="rating" CONTENT="General">
<META NAME="Copyright" CONTENT="Copyright 1999 © Van Lancker Luc">
<META NAME="Identifier-URL" CONTENT="../index.html">
<META NAME="Reply-to" CONTENT="Vanlancker.Luc@ccim.be">
<META NAME="Category" CONTENT="Internet">
<META NAME="robots" CONTENT="index, follow">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#000080" VLINK="#551A8B" ALINK="#FF0000" BACKGROUND="BGPAGE.gif">

<TABLE WIDTH="600" >
<TR>
<TD><FONT COLOR="#000080"><FONT SIZE=-1>&nbsp;&nbsp;Lignes de force</FONT></FONT>

<TABLE WIDTH="100%" >
<TR VALIGN=TOP>
<TD WIDTH="80%"><B><FONT COLOR="#000080"><FONT SIZE=+3>Aspect fonctionnel</FONT></FONT></B></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="visuel.htm"><IMG SRC="ARROWUP.gif" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="decoupe.htm"><IMG SRC="ARROWDOW.gif" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>
</TABLE>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="15"><IMG SRC="VIDE.gif" HEIGHT=12 WIDTH=12></TD>

<TD WIDTH="420"><B><I><FONT COLOR="#000080">Comprendre le fonctionnement
du Web et le comportement des internautes. </FONT></I></B>
<P>L'&eacute;cran de votre visiteur et surtout le Web sera le support de
votre publication. Ce nouveau moyen de communication a non seulement ses
sp&eacute;cificit&eacute;s techniques mais aussi d&eacute;j&agrave; ses
&quot;us et coutumes&quot;.</P>
</TD>

<TD WIDTH="165">
<CENTER><P><IMG SRC="TABFONC.gif" HEIGHT=120 WIDTH=160></P></CENTER>
</TD>
</TR>
</TABLE>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="15"><IMG SRC="VIDE.gif" HEIGHT=12 WIDTH=12></TD>

<TD WIDTH="585">Si dans la publication papier, il suffit de tourner la
feuille, sur le Web il faudra composer avec le temps de chargement de la
page. Commen&ccedil;ons par le texte. Une page de 15 &agrave; 30 K ne posera
pas de probl&egrave;mes c-&agrave;-d l'&eacute;quivalent d'une feuille
A4 maximum. Au-del&agrave;, le temps de chargement devient p&eacute;nalisant
surtout si en plus cette page comporte de nombreux tableaux imbriqu&eacute;s
qui ralentissent le chargement. Mais n'oubliez pas qu'en Html, toutes les
images sont des fichiers s&eacute;par&eacute;s qu'il faudra charger ensuite.
Un total d'images de 30 &agrave; 50 K semble &ecirc;tre dans la norme.
Au del&agrave; des 80 K pour une image, le d&eacute;lai d'attente devient
pour le capital patience de certains quelque chose de prohibitif surtout
pour une page d'accueil. N'oubliez pas qu'une image qui a d&eacute;j&agrave;
&eacute;t&eacute; charg&eacute;e, reste dans le &quot;cache&quot; de votre
navigateur et qu'il ne la rechargera plus &agrave; partir du r&eacute;seau
mais de votre disque dur ce qui entra&icirc;ne un chargement imm&eacute;diat.
Ce qui permet d'user et d'abuser des boutons, puces, tirets de s&eacute;parations
et autres banni&egrave;res qui se retrouvent de pages en pages et qui agr&eacute;mentent
votre mise en page et forment l'identit&eacute; visuelle d'un site. 
<P>Ces diff&eacute;rentes (petites) pages doivent &ecirc;tre structur&eacute;es
de fa&ccedil;on logique afin que l'internaute puisse naviguer efficacement
dans votre site. Nous consacrons plus loin dans le site un chapitre particulier
sur les diff&eacute;rentes structures d'un site Web. Il faudra aussi pr&eacute;voir
de petites ic&ocirc;nes pour que l'internaute puisse utiliser ais&eacute;ment
cette structure et se retrouver &agrave; tout moment dans l'exploration
de votre site. Les ma&icirc;tres du Web conseillent de pr&eacute;voir pour
chaque page une possibilit&eacute; de retour &agrave; la page d'accueil.
Ces petites ic&ocirc;nes de navigation devront &ecirc;tre d'un graphique
simple et &agrave; d'une symbolique intuitive. </P>

<P>L'essence du Web est la notion d'interactivit&eacute;. Interactivit&eacute;
entre les pages de votre site, interactivit&eacute; entre votre site et
les autres sites pr&eacute;sents sur le Web, interactivit&eacute; entre
le Web et les autres outils disponibles sur Internet (qu'il s'agisse des
moteurs de recherche, des e-mails, des listes de diffusion, des forums,
des fichiers &agrave; t&eacute;l&eacute;charger, etc...). Interactivit&eacute;,
enfin, entre vos visiteurs et l'auteur. Tout concepteur d'un site Web doit
toujours veiller &agrave; cr&eacute;er cette interactivit&eacute; que ce
soit simplement par de adresses e-mail cliquables, des formulaires (livres
d'or) &agrave; caract&egrave;re plus &quot;officiels&quot;, </P>

<P>Pour ma part, je n'ai jamais, pour visiter un site, t&eacute;l&eacute;charg&eacute;
un plugin, chang&eacute; de browser, modifi&eacute; la r&eacute;solution
d'&eacute;cran ou le nombre de couleurs de mon ordinateur. Et je ne crois
pas &ecirc;tre le seul ! Un site s'il peut &ecirc;tre optimis&eacute; pour
une configuration d&eacute;termin&eacute;e, doit rester compatible quel
que soit le visiteur. Juste retour aux sources de l'esprit d'universalit&eacute;
du Html et du Web. </P>
</TD>
</TR>
</TABLE>

<P><BR>
</P>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD COLSPAN="2">
<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>

<TR VALIGN=TOP>
<TD ALIGN=LEFT WIDTH="80%"></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="visuel.htm"><IMG SRC="ARROWUP.gif" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="decoupe.htm"><IMG SRC="ARROWDOW.gif" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

</BODY>

<!-- Mirrored from www.ccim.be/ccim328/archi/fonction.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:09 GMT -->
</HTML>
