<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<!-- Mirrored from www.ccim.be/ccim328/archi/fram_tab.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:13 GMT -->
<HEAD>
<TITLE>Architecture d'un site Web - En particulier - Frames ou tableaux 
</TITLE>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
<META HTTP-EQUIV="Content-language" CONTENT="fr">
<META NAME="Author" CONTENT="Van Lancker Luc">
<META NAME="Description" CONTENT="Architecture d'un site Web - Réflexions et stratégies pour la conception et l'organisation d'un site Web.">
<META NAME="KeyWords" CONTENT="webdesign,webdesigner,web design,site,page,developer,dévelopement,dévelopement site,guide,webguide,site web,site internet,création site,conception site,webmaster,webmestre,webstyle,tutorial,didacticiel,html,télécharger,download">
<META NAME="rating" CONTENT="General">
<META NAME="Copyright" CONTENT="Copyright 1999 © Van Lancker Luc">
<META NAME="Identifier-URL" CONTENT="../index.html">
<META NAME="Reply-to" CONTENT="Vanlancker.Luc@ccim.be">
<META NAME="Category" CONTENT="Internet">
<META NAME="robots" CONTENT="index, follow">   
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#000080" VLINK="#551A8B" ALINK="#FF0000" BACKGROUND="BGPAGE.gif">

<TABLE WIDTH="600" >
<TR>
<TD><FONT COLOR="#000080"><FONT SIZE=-1>&nbsp;&nbsp;En particulier</FONT></FONT>

<TABLE WIDTH="100%" >
<TR VALIGN=TOP>
<TD WIDTH="80%"><B><FONT COLOR="#000080"><FONT SIZE=+3>Frames ou tableaux</FONT></FONT></B></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="misenpage.htm"><IMG SRC="ARROWUP.gif" ALT="Uo" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="typo.htm"><IMG SRC="ARROWDOW.gif" ALT="Down" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="1%"><IMG SRC="VIDE.gif" HEIGHT=12 WIDTH=12></TD>

<TD>Les frames [cadres] permettent de diviser l'&eacute;cran en 2 ou plusieurs
fen&ecirc;tres et d'afficher dans chacune de celle-ci des documents Html
distincts. Ce syst&egrave;me offre une alternative puissante pour la conception
visuelle et l'organisation de la navigation d'une publication Web. 
<P>Les frames, introduits sous Netscape 3, n'&eacute;tait alors (1996)
pas reconnus par les autres navigateurs et donc d'un emploi limit&eacute;
pour peu que l'on souhaitait que le site soit visible par le plus grand
nombre. Adopt&eacute;s par Microsoft &agrave; partir d'Internet Explorer
3 et ses d&eacute;clinaisons suivantes ainsi que par d'autres navigateurs
r&eacute;cents, on peut affirmer qu'&agrave; l'aube de l'an 2000, il n'existe
quasiment plus de raisons de compatibilit&eacute; &agrave; l'utilisation
des frames dans un site. En outre la migration vers une r&eacute;solution
d'&eacute;cran plus grande (800x600 au lieu de 640x480) arrange visuellement
bien les choses. Pourtant les frames gardent leur part de d&eacute;tracteurs
qui pr&eacute;f&egrave;rent garder les pr&eacute;sentations sous forme
de tableaux.</P>

<TABLE BORDER=1 CELLSPACING=0 WIDTH="300" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD BGCOLOR="#000080"><B><FONT COLOR="#FFFFFF">AVANTAGES&nbsp;FRAMES</FONT></B></TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD>Simplicit&eacute; du code.</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD>Menu toujours pr&eacute;sent &agrave; l'&eacute;cran.</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD>Riches possibilit&eacute;s en Javascript.</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD>Code moins visible pour les d&eacute;butants.</TD>
</TR>
</TABLE>

<P>Bien que les frames ne soient pas implant&eacute;s directement dans
certains &eacute;diteurs Html, leur &eacute;criture est simple. Cette simplicit&eacute;
du code se paie par une grande rigueur au niveau des attributs des balises.
Les frames restent, pour les concepteurs d&eacute;butants, un des meilleurs
moyens pour &quot;s’emm&ecirc;ler les pinceaux&quot;.</P>

<P>Avec la division de l'&eacute;cran en fen&ecirc;tres, la tentation est
grande d'en r&eacute;server une pour y mettre le menu (complet) des points
abord&eacute;s dans le site et offrir ainsi un outil de navigation qui
sera toujours pr&eacute;sent sous les yeux de l'internaute. Ce genre de
frame sp&eacute;cialement appr&eacute;ci&eacute; pour les sites dont le
contenu est appel&eacute; &agrave; se d&eacute;velopper fr&eacute;quemment
car il suffira alors de modifier le seul fichier qui appara&icirc;t dans
cette frame.</P>

<P>Pour les concepteurs experts, les frames et surtout les frames invisibles,
pr&eacute;sentent de multiples possibilit&eacute;s </P>

<UL>
<LI>pour passer des valeurs d'une page &agrave; l'autre (en Javascript).
</LI>

<LI>pour masquer des donn&eacute;es jug&eacute;es confidentielles (compteurs,
statistiques). </LI>

<LI>pour pr&eacute;charger des images dans le cache. </LI>

<LI>etc.</LI>
</UL>

<P>Bien que l’astuce ne fera pas long feu, l’acc&egrave;s au code des pages
incluses dans les frames est un peu moins ais&eacute; pour les internautes
d&eacute;butants.</P>

<TABLE BORDER=1 CELLSPACING=0 WIDTH="410" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD BGCOLOR="#000080"><B><FONT COLOR="#FFFFFF">INCONVENIENTS FRAMES</FONT></B></TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD>R&eacute;f&eacute;rencement d&eacute;licat sur certains moteurs de
recherche (Hotbot).</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD>Barre de d&eacute;filement pas tr&egrave;s esth&eacute;tique.</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD>Manipulations plus difficiles pour les d&eacute;butants.</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD>Non compatible avec certains (rares) navigateurs texte.</TD>
</TR>
</TABLE>

<P>Le r&eacute;f&eacute;rencement aupr&egrave;s de certains moteurs de
recherche, sp&eacute;cialement ceux qui scannent le texte de la page, se
r&eacute;v&egrave;le une op&eacute;ration p&eacute;rilleuse voire impossible
car la page initiale de frames ne comporte que quelques lignes de code
Html. On ne se lancera dans une page d'accueil avec des frames qu'avec
une connaissance pointue des balises &quot;Meta&quot; et des trucs et astuces
de r&eacute;f&eacute;rencement.</P>

<P>La barre de d&eacute;filement introduites par d&eacute;faut, et par
ailleurs bien pratique, est souvent d'une esth&eacute;tique douteuse dans
l'ensemble visuel de votre page. Bien entendu, il est possible de la faire
dispara&icirc;tre [border=0 frameborder=no framespacing=0] mais si cela
fonctionne visuellement tr&egrave;s bien sous une r&eacute;solution d'&eacute;cran
d&eacute;termin&eacute;e (exemple 800x600), il est quasi certain qu'une
partie de votre menu, par exemple, sera inaccessible et donc impossible
&agrave; consulter, sous une r&eacute;solution inf&eacute;rieure (640x480).
</P>

<P>L'impression et l'enregistrement de la page sont rendus plus d&eacute;licats
voire impossibles pour les internautes d&eacute;butants.</P>

<P>Quelques rares navigateurs ne reconnaissent pas encore les frames mais
avec Netscape, Internet Explorer et Op&eacute;ra qui reconnaissent les
frames, on doit quand m&ecirc;me couvrir 95% des navigateurs utilis&eacute;s
sur le Web.</P>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>

<TABLE BORDER=1 CELLSPACING=0 WIDTH="300" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD BGCOLOR="#000080"><B><FONT COLOR="#FFFFFF">AVANTAGES TABLEAUX</FONT></B></TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD>Pr&eacute;sentation excellente. </TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD>Compatible avec tous navigateurs. </TD>
</TR>
</TABLE>

<P>V&eacute;ritable BABA du langage Html, les tableaux sont bien repris
par les diff&eacute;rents &eacute;diteurs du march&eacute;. Et c’est tant
mieux car ils sont tr&egrave;s utiles pour la mise en page, pour &quot;dessiner&quot;
une page Web au millim&egrave;tre pr&egrave;s. J’ai l’habitude de dire
&quot;En publication Html, tout est tableaux&quot;. Que ce soit pour cr&eacute;er
un alignement, une composition de page ou un menu de navigation, les tableaux
offrent toujours une pr&eacute;sentation impeccable et compatible avec
(vraiment) tous les navigateurs.</P>

<TABLE BORDER=1 CELLSPACING=0 WIDTH="410" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD BGCOLOR="#000080"><B><FONT COLOR="#FFFFFF">INCONVENIENTS TABLEAUX </FONT></B></TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP>Code entier &agrave; r&eacute;p&eacute;ter pour
chaque page &agrave; cr&eacute;er.</TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP>Lourdeur du code &agrave; t&eacute;l&eacute;charger
avec certains navigateurs.</TD>
</TR>

<TR>
<TD ALIGN=LEFT VALIGN=TOP>Encore quelques diff&eacute;rences entre Netscape
et Internet Explorer.</TD>
</TR>
</TABLE>

<P>Construire un menu de navigation qui se retrouve sur chacune des pages
d'un site peut se r&eacute;v&eacute;ler fastidieux car il faudra r&eacute;p&eacute;ter
pour chaque page le code entier. Heureusement qu'il y a le copier/coller.
Plus emb&ecirc;tant cependant, c'est lorsque le site conna&icirc;t de fr&eacute;quentes
mises &agrave; jour ou ajoutes. Il vous faudra alors modifier ce menu de
navigation dans toutes les pages du site alors qu'avec un menu de navigation
dans une frame, il suffit d'ajouter quelques lignes dans le fichier en
question.</P>

<P>Le navigateur compose les tableaux de la page &agrave; partir des balises
du langage Html. Si votre page comporte un grand tableau avec de nombreuses
lignes et colonnes, si ce tableau initial comporte de nombreux autres tableaux
imbriqu&eacute;s, l'op&eacute;ration de composition de la page peut prendre
un certain temps et allonger le temps de chargement. On &eacute;vitera
donc les tr&egrave;s grands tableaux bien compliqu&eacute;s. La solution
consiste &agrave; diviser ces grands tableaux en plusieurs tableaux plus
petits.</P>

<P>Il subsiste encore quelques diff&eacute;rences d’interpr&eacute;tation
des balises des tableaux entre les navigateurs Netscape et Internet Explorer.
Mais c’est une (triste) habitude. </P>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
<P><BR></P>
<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD COLSPAN="2">
<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>

<TR VALIGN=TOP>
<TD ALIGN=LEFT WIDTH="80%"></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="misenpage.htm"><IMG SRC="ARROWUP.gif" ALT="Up" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="typo.htm"><IMG SRC="ARROWDOW.gif" ALT="Down" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

</BODY>

<!-- Mirrored from www.ccim.be/ccim328/archi/fram_tab.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:13 GMT -->
</HTML>
