<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<!-- Mirrored from www.ccim.be/ccim328/archi/misenpage.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:13 GMT -->
<HEAD>
<TITLE>Architecture d'un site Web - En particulier - La mise en page 
</TITLE>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
<META HTTP-EQUIV="Content-language" CONTENT="fr">
<META NAME="Author" CONTENT="Van Lancker Luc">
<META NAME="Description" CONTENT="Architecture d'un site Web - Réflexions et stratégies pour la conception et l'organisation d'un site Web.">
<META NAME="KeyWords" CONTENT="webdesign,webdesigner,web design,site,page,developer,dévelopement,dévelopement site,guide,webguide,site web,site internet,création site,conception site,webmaster,webmestre,webstyle,tutorial,didacticiel,html,télécharger,download">
<META NAME="rating" CONTENT="General">
<META NAME="Copyright" CONTENT="Copyright 1999 © Van Lancker Luc">
<META NAME="Identifier-URL" CONTENT="../index.html">
<META NAME="Reply-to" CONTENT="Vanlancker.Luc@ccim.be">
<META NAME="Category" CONTENT="Internet">
<META NAME="robots" CONTENT="index, follow">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#000080" VLINK="#551A8B" ALINK="#FF0000" BACKGROUND="BGPAGE.gif">

<TABLE WIDTH="600" >
<TR>
<TD><FONT COLOR="#000080"><FONT SIZE=-1>&nbsp;&nbsp;En particulier</FONT></FONT>

<TABLE WIDTH="100%" >
<TR VALIGN=TOP>
<TD WIDTH="80%"><B><FONT COLOR="#000080"><FONT SIZE=+3>La mise en page</FONT></FONT></B></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="zone.htm"><IMG SRC="ARROWUP.gif" ALT="Uo" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="fram_tab.htm"><IMG SRC="ARROWDOW.gif" ALT="Down" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>
</TABLE>

<TABLE WIDTH="600" >
<TR>
<TD><B><I><FONT COLOR="#000080">Classique ou &quot;d&eacute;lire&quot;
? Livresque ou audiovisuel ?</FONT></I></B> 
<P>Comment allez vous pr&eacute;senter votre information sur ce m&eacute;dium
particulier qu’est l’&eacute;cran de votre visiteur reli&eacute; &agrave;
la toile ? D’un fa&ccedil;on classique, quasiment livresque ou, profitant
des derni&egrave;res technologies en mati&egrave;re de publication sur
le Web, puiserez-vous votre inspiration dans les cr&eacute;ations audiovisuelles
comme la t&eacute;l&eacute;vision et sp&eacute;cialement ses bandes annonces
ou ses spots publicitaires ?<BR>&nbsp;</P>
</TD>
</TR>
</TABLE>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="1%"><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>Le point de vue du classique</FONT></FONT>

<P>La transmission d’un savoir se fait, autant pour l’auteur que pour le
lecteur, d’une fa&ccedil;on structur&eacute;e et claire. On ne peut passer
outre &agrave; l’h&eacute;ritage culturel de si&egrave;cles d’&eacute;dition
au risque de d&eacute;contenancer le visiteur. Titres, chapitres, sous-chapitres,
&eacute;ventuellement en-t&ecirc;te et pieds de page apportent une hi&eacute;rarchie
du contenu qui permettra tout au long de l’expos&eacute; d’aller du principal
au particulier et qui induira ainsi une structuration de la connaissance.
Clart&eacute; et nettet&eacute; de la mise en page restent et resteront
le ma&icirc;tre mot de votre expression. Les animations et autres effets
visuels ou dynamiques ne font que distraire le lecteur du v&eacute;ritable
contenu et cr&eacute;er &agrave; la longue un sentiment d'inconsistance
pour finalement le lasser de votre site. Le Web restera avant tout un formidable
r&eacute;servoir d’informations m&ecirc;me si certains veulent en faire
un parc de loisirs. Il importera devant cette profusion d’informations,
qui ira &agrave; n’en pas douter de fa&ccedil;on croissante, d’apporter
une information pertinente, d&eacute;taill&eacute;e, actualis&eacute;e
et surtout facilement accessible. La v&eacute;ritable dynamique du Web
ne r&eacute;side pas dans ces animations que l’on dit r&eacute;volutionnaires,
mais dans la d&eacute;marche active de l’internaute vers l’information
qu’il souhaite trouver. C’est cette information qu’il faut lui donner,
pas des &quot;mots qui bougent&quot;... Au royaume du Web, plus que jamais
le contenu sera roi. <BR>&nbsp;</P>
</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>Le point de vue du &quot;d&eacute;lire&quot;</FONT></FONT>

<P>Avec les derniers d&eacute;veloppements du Javascript, du Dhtml voire
de Flash, la mise en page des sites Web sera profond&eacute;ment boulevers&eacute;e.
Les diverses animations sur le texte ou les images, pour autant qu'elles
ne soient pas inutilement gratuites, viennent renforcer la transmission
de l'information. Le livre n'est pas le seul moyen de communication. Il
y a aussi l'audiovisuel et les pr&eacute;sentations multim&eacute;dia.
Les publicitaires l'ont bien compris et leurs spots &agrave; la t&eacute;l&eacute;vision
ne font plus que raconter leur histoire de la fa&ccedil;on la plus convaincante
possible mais par des effets dynamiques attirent le regard et l'esprit
pour tant&ocirc;t faire ressortir un mot ou un logo ou tant&ocirc;t synth&eacute;tiser
un message. Il est &eacute;vident que le contenu ne suffit plus et que
c'est le message qui sera transmis de la fa&ccedil;on la plus performante
qui l'emportera. Les gens ne lisent plus ou tr&egrave;s peu... par contre
ils passent des heures &agrave; regarder de fa&ccedil;on consciente ou
non leur poste de t&eacute;l&eacute;vision. Consciemment ou non, ils s'attendent
&agrave; retrouver lors de leur exploration du Web, la m&ecirc;me forme
d'expression et le m&ecirc;me environnement visuel. Le langage Html et
ses d&eacute;veloppements annexes poss&egrave;dent maintenant tous les
outils pour mettre en place son propre mode d'expression, cr&eacute;atif
et dynamique.<BR>&nbsp;</P>
</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>En conclusion</FONT></FONT> 
<P>Bien au-del&agrave; d'un exercice de style, ces deux points de vue ne
sont pourtant pas inconciliables. La mise en page sera dict&eacute;e par
la densit&eacute; du contenu et surtout par le public vis&eacute;. N'oubliez
cependant jamais que cette mise en page doit &ecirc;tre au service de la
transmission de l'information et rester claire, nette et efficace. Et si
on se posait la question de savoir &agrave; quoi ressemblera la mise en
page d'un site Web d'ici 5 ou 10 ans...<BR>&nbsp;</P>
</TD>
</TR>
</TABLE>

<P><BR>
</P>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD COLSPAN="2">
<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>

<TR VALIGN=TOP>
<TD ALIGN=LEFT WIDTH="80%"></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="zone.htm"><IMG SRC="ARROWUP.gif" ALT="Up" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="fram_tab.htm"><IMG SRC="ARROWDOW.gif" ALT="Down" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

</BODY>

<!-- Mirrored from www.ccim.be/ccim328/archi/misenpage.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:13 GMT -->
</HTML>
