<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<!-- Mirrored from www.ccim.be/ccim328/archi/resolution.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:12 GMT -->
<HEAD>
<TITLE>Architecture d'un site Web - En particulier - La r&eacute;solution d'&eacute;cran 
</TITLE>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
<META HTTP-EQUIV="Content-language" CONTENT="fr">
<META NAME="Author" CONTENT="Van Lancker Luc">
<META NAME="Description" CONTENT="Architecture d'un site Web - Réflexions et stratégies pour la conception et l'organisation d'un site Web.">
<META NAME="KeyWords" CONTENT="webdesign,webdesigner,web design,site,page,developer,dévelopement,dévelopement site,guide,webguide,site web,site internet,création site,conception site,webmaster,webmestre,webstyle,tutorial,didacticiel,html,télécharger,download">
<META NAME="rating" CONTENT="General">
<META NAME="Copyright" CONTENT="Copyright 1999 © Van Lancker Luc">
<META NAME="Identifier-URL" CONTENT="../index.html">
<META NAME="Reply-to" CONTENT="Vanlancker.Luc@ccim.be">
<META NAME="Category" CONTENT="Internet">
<META NAME="robots" CONTENT="index, follow">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#000080" VLINK="#551A8B" ALINK="#FF0000" BACKGROUND="BGPAGE.gif">

<TABLE WIDTH="600" >
<TR>
<TD><FONT COLOR="#000080"><FONT SIZE=-1>&nbsp;&nbsp;En particulier</FONT></FONT>

<TABLE WIDTH="100%" >
<TR VALIGN=TOP>
<TD WIDTH="80%"><B><FONT COLOR="#000080"><FONT SIZE=+3>La r&eacute;solution
d'&eacute;cran</FONT></FONT></B></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="regles.htm"><IMG SRC="ARROWUP.gif" ALT="Uo" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="zone.htm"><IMG SRC="ARROWDOW.gif" ALT="Down" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>

<TABLE WIDTH="600" >
<TR>
<TD>Les concepteurs d&eacute;butants posent souvent la (mauvaise) question
: &quot;Pour quelle r&eacute;solution d'&eacute;cran doit-on concevoir
un site ?&quot;. C'est une mauvaise question car vous ne conna&icirc;trez
jamais la r&eacute;solution d'&eacute;cran de votre visiteur. Et une annotation
du genre &quot;site optimis&eacute; en 800 x 600&quot; est assez illusoire
car les internautes qui changeront leur r&eacute;solution uniquement pour
voir votre site sont rarissimes. Il existe cependant certaines solutions
pour rendre votre site esth&eacute;tiquement compatible avec n'importe
quelle r&eacute;solution d'&eacute;cran.
<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>
</TD>
</TR>
</TABLE>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="1%"><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>Pr&eacute;sentation</FONT></FONT>

<P>Beaucoup de gens pensent que la r&eacute;solution d'&eacute;cran (ou
&quot;espace du bureau&quot; selon Microsoft) d&eacute;pend de la taille
de l'&eacute;cran. Ce qui est faux. On peut avoir un &eacute;cran de 14
pouces et avoir une haute r&eacute;solution ou avoir un &eacute;cran de
21 pouces et n'avoir qu'une r&eacute;solution d'&eacute;cran de seulement
640 x 480. 640 signifie 640 pixels de fa&ccedil;on horizontale et 480 pour
480 pixels de fa&ccedil;on verticale. </P>

<CENTER><P><IMG SRC="SCR640.gif" HEIGHT=165 WIDTH=220></P></CENTER>

<P>La plupart des moniteurs peuvent afficher diff&eacute;rentes r&eacute;solutions
d'&eacute;cran. C'est la carte graphique qui d&eacute;termine les diff&eacute;rentes
r&eacute;solutions d'&eacute;cran possibles pour un ordinateur donn&eacute;.
Ainsi, il y a quelques ann&eacute;es, avec les cartes graphiques de 1 m&eacute;ga,
la norme &eacute;tait en 640 x 480, ce qui &eacute;tait confortable pour
les applications bureautiques. Avec l'&eacute;volution de ces cartes, le
800 x 600 est apparu. Et avec l'introduction sinon la g&eacute;n&eacute;ralisation
des cartes graphiques &agrave; 4 m&eacute;gas de m&eacute;moire, les r&eacute;solutions
1024 x 768 ou m&ecirc;me 1280 x 1024 sont possibles &agrave; d&eacute;faut
d'&ecirc;tre fr&eacute;quentes. Les internautes suivent bien entendu cette
&eacute;volution technologique et la r&eacute;solution 640 x 480 qui &eacute;tait
la norme il y a encore quelques ann&eacute;es, est en voie de disparition
au profit de r&eacute;solutions plus hautes.</P>

<P>Avec toutes les pr&eacute;cautions d'usage quant &agrave; la pr&eacute;cision
des chiffres suivants et apr&egrave;s recoupement de plusieurs sources,
on peut (&agrave; fin 1999) se r&eacute;f&eacute;rer au tableau suivant
qui donne une id&eacute;e de la r&eacute;partition des diff&eacute;rentes
r&eacute;solutions utilis&eacute;es pour le Web.</P>

<CENTER><P><IMG SRC="TABRESOL.gif" HEIGHT=111 WIDTH=228></P></CENTER>

<P>Comme vous voyez, la moyenne des utilisateurs du Web utilisent une r&eacute;solution
d'&eacute;cran de 800x600 [et en 65.536 couleurs]. Mais &eacute;crire pour
la moyenne n'est pas tout... Il reste les 45 % autres internautes pour
qui votre site risque d'&ecirc;tre une v&eacute;ritable catastrophe. </P>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>
</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>Illustration du probl&egrave;me
</FONT></FONT>
<P>Le premier exemple montre une page avec un image reprenant les lettres
de l’alphabet. Avec une r&eacute;solution 800x600, cette image s’adapte
parfaitement &agrave; l’&eacute;cran. Par contre, cette m&ecirc;me page,
vue en 640x480 est d&eacute;j&agrave; beaucoup moins sympathique. </P>

<P>L’utilisateur devra non seulement faire appel au d&eacute;filement vertical
pour voir l’enti&egrave;ret&eacute; des lettres mais &eacute;galement au
d&eacute;filement horizontal car les lettres K et L ont disparue de l’&eacute;cran.
Si le d&eacute;filement vertical est acceptable car finalement indispensable
d&egrave;s qu’une page est d’une certaine consistance (et encore m&eacute;fiez
vous des novices du Web qui ne l’utilisent que tr&egrave;s peu), le d&eacute;filement
horizontal est &agrave; bannir car trop inconfortable pour votre visiteur.
</P>

<CENTER><TABLE WIDTH="90%" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="50%"><FONT SIZE=-1>R&eacute;solution 800x600</FONT></TD>

<TD WIDTH="50%"><FONT SIZE=-1>R&eacute;solution 640x480</FONT></TD>
</TR>

<TR VALIGN=TOP>
<TD>
<CENTER><P><IMG SRC="RABC_800.gif" HEIGHT=165 WIDTH=220></P></CENTER>
</TD>

<TD>
<CENTER><P><IMG SRC="RABC_600.gif" HEIGHT=165 WIDTH=220></P></CENTER>
</TD>
</TR>
</TABLE></CENTER>

<P>Le second exemple tente d'illustrer les diff&eacute;rences de mise en
page et surtout la longueur des lignes de texte d’une r&eacute;solution
&agrave; l’autre. </P>

<P>Si une page reprend principalement du texte, plus la r&eacute;solution
est haute, plus la ligne de texte sera longue et donc plus la lecture de
ce texte &agrave; l’&eacute;cran sera fastidieuse. Lire du texte sur un
&eacute;cran en 1280x1024 reviendrait &agrave; lire un journal o&ugrave;
le texte serait imprim&eacute; d’un bord &agrave; l’autre - sans colonnes
-. Pas pratique du tout et il faut avoir de bons yeux ! </P>

<CENTER><TABLE WIDTH="90%" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="50%"><FONT SIZE=-1>R&eacute;solution 800x600</FONT></TD>

<TD WIDTH="50%"><FONT SIZE=-1>R&eacute;solution 640x480</FONT></TD>
</TR>

<TR ALIGN=CENTER VALIGN=TOP>
<TD><IMG SRC="TEXTE800.gif" HEIGHT=165 WIDTH=220></TD>

<TD><IMG SRC="TEXTE600.gif" HEIGHT=165 WIDTH=220></TD>
</TR>
</TABLE></CENTER>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>
</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>Quelques solutions</FONT></FONT>

<P>Il faut bien admettre qu’en 640, le composition de la page est un peu
&eacute;triqu&eacute;e. Avec des r&eacute;solutions plus hautes, on peut
concevoir des pages plus a&eacute;r&eacute;es et aux proportions plus &eacute;quilibr&eacute;es.
En outre, cette largeur suppl&eacute;mentaire permet g&eacute;n&eacute;ralement
de pr&eacute;voir des menus de navigation omnipr&eacute;sents sur chaque
page du site. </P>

<P>Passons en revue quelques solutions pour garder une certaine compatibilit&eacute;
par rapport aux diff&eacute;rentes r&eacute;solutions possibles.</P>

<TABLE WIDTH="100%" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="1%"><IMG SRC="BUTT.gif" VSPACE=3 HEIGHT=13 WIDTH=11></TD>

<TD>On limitera la largeur des images &agrave; environ 600 pixels m&ecirc;me
pour les sites id&eacute;alement con&ccedil;us en 800x600 ou en r&eacute;solution
plus grande encore afin d’&eacute;viter de devoir utiliser les barres de
d&eacute;filement horizontales, sous des r&eacute;solutions inf&eacute;rieures.
Cette limitation vaut aussi pour les tableaux et les frames &eacute;labor&eacute;s
avec une largeur fix&eacute;e en pixels.</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="BUTT.gif" VSPACE=3 HEIGHT=13 WIDTH=11></TD>

<TD>On pensera &agrave; inclure les longs passages de texte dans des tableaux
(&agrave; bordure invisible) d’environ 600 pixels maximum. On obtiendra
ainsi des lignes de texte de 60 &agrave; 90 caract&egrave;res, ce qui semble
&ecirc;tre une norme acceptable pour un confort de lecture &agrave; l’&eacute;cran.
</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="BUTT.gif" VSPACE=3 HEIGHT=13 WIDTH=11></TD>

<TD>On se m&eacute;fiera des arri&egrave;re-plans sous forme d’une fine
bande horizontale. Il faut les pr&eacute;voir d’entr&eacute;e avec une
largeur de 1280 pixels afin qu’ils s’adaptent &agrave; toutes les r&eacute;solutions
possibles sans devoir se r&eacute;p&eacute;ter horizontalement, ce qui
entra&icirc;ne g&eacute;n&eacute;ralement des effets non d&eacute;sir&eacute;s
et d&eacute;sastreux (raccord).</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="BUTT.gif" VSPACE=3 HEIGHT=13 WIDTH=11></TD>

<TD>Comme toujours pour la cr&eacute;ation de sites Web, testez, testez
encore et testez toujours.</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="BUTT.gif" VSPACE=3 HEIGHT=13 WIDTH=11></TD>

<TD>Finalement (voir les remarques sur les images et le texte), on rencontre
de plus en plus de sites qui sont con&ccedil;us en 600 pixels de large
pour &ecirc;tre vus en 800x600 ou plus. Le reste de la largeur &eacute;tant
un arri&egrave;re-plan neutre. La page reste alors toujours bien lisible
quelque soit la r&eacute;solution. </TD>
</TR>
</TABLE>

<CENTER><TABLE WIDTH="90%" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="50%"><FONT SIZE=-1>R&eacute;solution 640x480</FONT></TD>

<TD WIDTH="50%"><FONT SIZE=-1>R&eacute;solution 800x600</FONT></TD>
</TR>

<TR ALIGN=CENTER VALIGN=TOP>
<TD><IMG SRC="fina640.gif" HEIGHT=165 WIDTH=220></TD>

<TD VALIGN=TOP><IMG SRC="fina800.gif" HEIGHT=165 WIDTH=220></TD>
</TR>
</TABLE></CENTER>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>
</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>Remarque finale</FONT></FONT> 
<P>Avec le Javascript 1.2, on peut maintenant d&eacute;tecter (sans pouvoir
la modifier cependant) la r&eacute;solution d'&eacute;cran de l’internaute
et le rediriger automatiquement vers une page sp&eacute;cialement con&ccedil;ue
pour cette r&eacute;solution [screen width et screen.height]. Int&eacute;ressant
s&ucirc;rement mais cela &eacute;quivaut alors &agrave; &eacute;crire quasiment
un site pour chaque r&eacute;solution. Mais quel boulot ! </P>
</TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>

<P><BR>
</P>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD COLSPAN="2">
<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>

<TR VALIGN=TOP>
<TD ALIGN=LEFT WIDTH="80%"></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="regles.htm"><IMG SRC="ARROWUP.gif" ALT="Up" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="zone.htm"><IMG SRC="ARROWDOW.gif" ALT="Down" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

</BODY>

<!-- Mirrored from www.ccim.be/ccim328/archi/resolution.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:12 GMT -->
</HTML>
