<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<!-- Mirrored from www.ccim.be/ccim328/archi/structure.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:10 GMT -->
<HEAD>
   <TITLE>Architecture d'un site Web - Structure</TITLE>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
<META HTTP-EQUIV="Content-language" CONTENT="fr">
<META NAME="Author" CONTENT="Van Lancker Luc">
<META NAME="Description" CONTENT="Architecture d'un site Web - Réflexions et stratégies pour la conception et l'organisation d'un site Web.">
<META NAME="KeyWords" CONTENT="webdesign,webdesigner,web design,site,page,developer,dévelopement,dévelopement site,guide,webguide,site web,site internet,création site,conception site,webmaster,webmestre,webstyle,tutorial,didacticiel,html,télécharger,download">
<META NAME="rating" CONTENT="General">
<META NAME="Copyright" CONTENT="Copyright 1999 © Van Lancker Luc">
<META NAME="Identifier-URL" CONTENT="../index.html">
<META NAME="Reply-to" CONTENT="Vanlancker.Luc@ccim.be">
<META NAME="Category" CONTENT="Internet">
<META NAME="robots" CONTENT="index, follow">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#000080" VLINK="#551A8B" ALINK="#FF0000" BACKGROUND="BGPAGE.gif">

<TABLE WIDTH="600" >
<TR>
<TD><FONT COLOR="#000080"><FONT SIZE=-1>&nbsp;&nbsp;Architecture</FONT>
d'un site </FONT>
<TABLE WIDTH="100%" >
<TR VALIGN=TOP>
<TD WIDTH="80%"><B><FONT COLOR="#000080"><FONT SIZE=+3>Structure</FONT></FONT></B></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="decoupe.htm"><IMG SRC="ARROWUP.gif" ALT="Uo" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="outils.htm"><IMG SRC="ARROWDOW.gif" ALT="Down" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>
</TABLE>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="1%"><IMG SRC="VIDE.gif" HEIGHT=12 WIDTH=12></TD>

<TD><B><I><FONT COLOR="#000080">Sans une structure fonctionnelle, votre
site sera un &eacute;chec m&ecirc;me si le contenu en est pertinent et
bien r&eacute;dig&eacute;. </FONT></I></B>
<P>&quot;La chose la plus importante &agrave; consid&eacute;rer lorsqu'on
pr&eacute;pare le design d'un site Web, c'est la satisfaction des utilisateurs.
La facilit&eacute; avec laquelle ils trouveront ce qu’ils recherchent d&eacute;terminera
la fr&eacute;quence avec laquelle ils reviendront sur le site. Eviter de
frustrer les internautes est l'objectif principal du design. Et au bout
du compte, savoir structurer l'information qu'on pr&eacute;sente est la
base fondamentale d'une exp&eacute;rience r&eacute;ussie sur le Web.&quot;
(Val&eacute;rie Casey, professeur de Web Design &agrave; l'Universit&eacute;
de San Francisco) </P>

<P>Le but est de fournir &agrave; l'usager l'information qu'il souhaite
en un minimum d'&eacute;tapes et donc un minimum de temps. Pour autant
que des normes strictes existent en la mati&egrave;re, on parle de la &quot;r&egrave;gle
des 3 clics&quot; selon laquelle toute information de votre site doit &ecirc;tre
disponible en maximum 3 clics de souris. Il faut donc hi&eacute;rarchiser
l'information selon une structure efficiente pour minimiser la navigation
vers l'information. </P>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>
</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>Structure s&eacute;quentielle</FONT></FONT>

<P>Le moyen le plus simple d'organiser l'information est la fa&ccedil;on
s&eacute;quentielle C'est en quelque sorte le retour au livre avec sa narration
lin&eacute;aire : chapitre 1, chapitre 2, chapitre 3...</P>

<CENTER><P><IMG SRC="SEQ.gif" ALT="Structure séquentielle" HEIGHT=41 WIDTH=186></P></CENTER>

<P>Les narrations, les lignes du temps ou autres expos&eacute;s n&eacute;cessitant
un ordre logique se pr&ecirc;tent &agrave; ce genre de structure ainsi
que les th&egrave;mes progressant du g&eacute;n&eacute;ral au particulier.
La structure s&eacute;quentielle est aussi particuli&egrave;rement adapt&eacute;e
aux sites d'apprentissage ou tutoriaux o&ugrave; le passage &agrave; une
page suivante requiert des pr&eacute;-requis expos&eacute;s &agrave; la
page pr&eacute;c&eacute;dente. </P>

<P>Cependant, cette structure s&eacute;quentielle ne sera utilis&eacute;e
que pour des petits sites (ou des parties de sites plus grands) car de
longues s&eacute;quences narratives ou explicatives n&eacute;cessiteront
souvent une structure plus sophistiqu&eacute;e pour rester compr&eacute;hensives.
</P>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>
</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>Structure hi&eacute;rarchis&eacute;e</FONT></FONT>

<P>La structure hi&eacute;rarchis&eacute;e est une des meilleures fa&ccedil;ons
d'organiser des blocs d'information complexes. Ce sch&eacute;ma d'organisation
s'adapte particuli&egrave;rement bien au site Web car les diff&eacute;rents
th&egrave;mes d&eacute;pendent ainsi d'une seule et unique page soit la
page d'index ou page d'accueil [homepage]. En outre les utilisateurs sont
souvent familiaris&eacute;s avec les diagrammes hi&eacute;rarchis&eacute;s
comme les organigrammes et trouveront la m&eacute;taphore facilement compr&eacute;hensible
pour les aider dans leur navigation.</P>

<CENTER><P><IMG SRC="HIERAR.gif" ALT="Structure hiérarchisée" HEIGHT=133 WIDTH=188></P></CENTER>

<P>Cette organisation hi&eacute;rarchis&eacute;e en blocs d'information
ind&eacute;pendants n&eacute;cessite cependant un gros travail d'analyse
pr&eacute;alable de votre contenu (notions pr&eacute;-requises, doublons
d'information...) car cette structure hi&eacute;rarchis&eacute;e ne sera
efficiente que si vous avez soigneusement organis&eacute; l'information
disponible.</P>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>
</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>Structure en r&eacute;seau</FONT></FONT>

<P>Ces mini Webs fonctionnent bien pour des petits sites destin&eacute;s
&agrave; des utilisateurs hautement qualifi&eacute;s en qu&ecirc;te d’enrichissement
ou de perfectionnement plut&ocirc;t qu'&agrave; la compr&eacute;hension
basique d'un sujet. On travaillera ici les associations d’id&eacute;es
et le libre cours de la pens&eacute;e. Chaque visiteur parcourra votre
site de fa&ccedil;on unique selon ses propres int&eacute;r&ecirc;ts et
sa propre d&eacute;marche vers l’information sans avoir l’impression d’&ecirc;tre
dirig&eacute;.</P>

<P>Ce type de structure exploite la pleine puissance des liens vers des
informations &agrave; l’int&eacute;rieur du site et vers des informations
situ&eacute;e dans d’autres sites de la toile.</P>

<CENTER><P><IMG SRC="RESEAU.gif" ALT="Structure en réseau" HEIGHT=132 WIDTH=189></P></CENTER>

<P>Cette structure en r&eacute;seau se r&eacute;v&egrave;le cependant ardue
&agrave; mettre en place et finalement peu pratique surtout pour les internautes
novices dans le sujet trait&eacute;. Ceux-ci auront alors l’id&eacute;e
d’un site confus, difficilement exploitable. </P>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>
</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>En pratique</FONT></FONT> 
<P>Rares sont cependant les visiteurs qui suivront &agrave; la lettre le
sch&eacute;ma de votre structure et ils retrouveront bien vite leurs habitudes
de navigation propres au Web soit de fa&ccedil;on libre et non-lin&eacute;aire.
Paradoxalement, ce &quot;surf&quot; sur les diff&eacute;rentes informations
ne se r&eacute;v&egrave;le efficace qu'avec une structure bien organis&eacute;e
qui compl&egrave;te les lignes de force de la conception de votre site.
</P>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>
</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD><IMG SRC="SMALL.gif" VSPACE=3 HEIGHT=14 WIDTH=13></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=+1>Structure en &eacute;volution</FONT></FONT>

<P>Pour les sites qui connaissent une croissance rapide et de nombreux
d&eacute;veloppements, l'objectif sera de garder un &eacute;quilibre entre
les diff&eacute;rents blocs d'informations. Et ce n'est pas toujours une
chose ais&eacute;e... Le feedback de vos utilisateurs et une analyse personnelle
critique de votre site vous aideront &agrave; d&eacute;terminer si certains
passages ne sont que pauvrement structur&eacute;s ou m&ecirc;me si votre
structure initiale est devenue, avec les diff&eacute;rentes ajoutes, compl&egrave;tement
obsol&egrave;te.</P>

<P>L'objectif sera de maintenir une hi&eacute;rarchisation &eacute;quilibr&eacute;e
qui aidera l'acc&egrave;s rapide &agrave; l'information et une compr&eacute;hension
intuitive de la fa&ccedil;on dont les &eacute;l&eacute;ments sont organis&eacute;s.</P>

<CENTER><P><FONT SIZE=-1>Exemple d’une structure &eacute;quilibr&eacute;e
</FONT></P></CENTER>

<CENTER><P><IMG SRC="EQUI.gif" ALT="Structure en évolution" HEIGHT=238 WIDTH=356></P></CENTER>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>
</TD>
</TR>

<TR ALIGN=LEFT VALIGN=TOP>
<TD></TD>

<TD><FONT COLOR="#000080"><FONT SIZE=-1>Sources</FONT></FONT> 
<P><FONT SIZE=-1>Le contenu de cette page consacr&eacute;e &agrave; la
structure d’un site Web est fortement inspir&eacute; de l’excellent site
Web Style Guide qui fait r&eacute;f&eacute;rence en la mati&egrave;re.
Les graphiques de cette page sont issus de la m&ecirc;me source. Copyright
Lynch &amp; Horton, 1997. Yale University. <A HREF="http://info.med.yale.edu/caim/manual/">http://info.med.yale.edu/caim/manual/</A>
</FONT></P>
</TD>
</TR>
</TABLE>

<P><BR>
</P>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD COLSPAN="2">
<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>

<TR VALIGN=TOP>
<TD ALIGN=LEFT WIDTH="80%"></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="decoupe.htm"><IMG SRC="ARROWUP.gif" ALT="Up" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="outils.htm"><IMG SRC="ARROWDOW.gif" ALT="Down" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

</BODY>

<!-- Mirrored from www.ccim.be/ccim328/archi/structure.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:10 GMT -->
</HTML>
