<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<!-- Mirrored from www.ccim.be/ccim328/archi/typo.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:13 GMT -->
<HEAD>
<TITLE>Architecture d'un site Web - En particulier - La typographie </TITLE>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
<META HTTP-EQUIV="Content-language" CONTENT="fr">
<META NAME="Author" CONTENT="Van Lancker Luc">
<META NAME="Description" CONTENT="Architecture d'un site Web - Réflexions et stratégies pour la conception et l'organisation d'un site Web.">
<META NAME="KeyWords" CONTENT="webdesign,webdesigner,web design,site,page,developer,dévelopement,dévelopement site,guide,webguide,site web,site internet,création site,conception site,webmaster,webmestre,webstyle,tutorial,didacticiel,html,télécharger,download">
<META NAME="rating" CONTENT="General">
<META NAME="Copyright" CONTENT="Copyright 1999 © Van Lancker Luc">
<META NAME="Identifier-URL" CONTENT="../index.html">
<META NAME="Reply-to" CONTENT="Vanlancker.Luc@ccim.be">
<META NAME="Category" CONTENT="Internet">
<META NAME="robots" CONTENT="index, follow">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#000080" VLINK="#551A8B" ALINK="#FF0000" BACKGROUND="BGPAGE.gif">

<TABLE WIDTH="600" >
<TR>
<TD><FONT COLOR="#000080"><FONT SIZE=-1>&nbsp;&nbsp;En particulier</FONT></FONT>

<TABLE WIDTH="100%" >
<TR VALIGN=TOP>
<TD WIDTH="80%"><B><FONT COLOR="#000080"><FONT SIZE=+3>La typographie</FONT></FONT></B></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="fram_tab.htm"><IMG SRC="ARROWUP.gif" ALT="Uo" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>
</TABLE>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="1%"><IMG SRC="VIDE.gif" HEIGHT=12 WIDTH=12></TD>

<TD>Il faut bien admettre qu’en publication Web, ce n’est pas &eacute;vident
de composer avec les polices de caract&egrave;res... Et c’est peut-&ecirc;tre
finalement tr&egrave;s bien ainsi ! 
<P>En langage Html, on peut utiliser n’importe quelle police de caract&egrave;re
mais &agrave; la condition que celle-ci soit install&eacute;e sur l’ordinateur
de votre visiteur. Ainsi, si vous &eacute;crivez tout votre site avec la
police Amelia et si cette police n’est pas install&eacute;e sur le poste
de votre visiteur, celui-ci verra votre site dans la police par d&eacute;faut
de son navigateur soit g&eacute;n&eacute;ralement en Times New Roman. </P>

<P>La solution la plus utilis&eacute;e &agrave; ce jour consiste &agrave;
mettre certains mots comme les titres dans une police diff&eacute;rente
et de les capturer sous forme d’image. Mais ce n’est pas la solution miracle
sp&eacute;cialement en ce qui concerne le r&eacute;f&eacute;rencement par
les moteurs de recherche et pour le temps de chargement.</P>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>

<P>Une solution consiste &agrave; employer les polices par d&eacute;faut
du syst&egrave;me d’exploitation, polices que tout utilisateur est sens&eacute;
avoir sur sa machine. Mais on ne peut pas dire qu’elles apportent grand
chose de plus que les classique Times New Roman ou Arial.</P>

<CENTER><P><FONT SIZE=-1>Polices par d&eacute;faut pour Windows 95 et Macintosh
</FONT></P></CENTER>

<CENTER><P><IMG SRC="default_fonts.gif" HEIGHT=391 WIDTH=364></P></CENTER>

<CENTER><P><FONT SIZE=-1>source : Web Style Guide http://info.med.yale.edu/caim/manual/</FONT></P></CENTER>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>

<P>Dans ce chapitre consacr&eacute; aux polices, il me semble int&eacute;ressant
de relever que le rendu des polices est diff&eacute;rent selon le syst&egrave;me
d’exploitation. En effet, avec les navigateurs sous Windows, les caract&egrave;res
(d’une m&ecirc;me police) apparaissent un peu plus grand que sous Macintosh.
Quand je vous disais qu’en langage Html, on n’a jamais le contr&ocirc;le
absolu du document !</P>

<CENTER><P><FONT SIZE=-1>Taille de certaines polices sous Windows et Macintosh</FONT></P></CENTER>

<CENTER><P><IMG SRC="font_sizes.gif" HEIGHT=285 WIDTH=365></P></CENTER>

<CENTER><P><FONT SIZE=-1>source : Web Style Guide http://info.med.yale.edu/caim/manual/</FONT></P></CENTER>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>

<P>La v&eacute;ritable solution pour que votre site dispose de polices
un peu originales existe mais est &agrave; ce jour [fin 1999] encore d’un
emploi rare et r&eacute;serv&eacute; aux sites Hi-Tech. Cette solution
s’appelle PFR (Portable Font Resource) ou encore Dynamic Fonts. La police
que vous souhaitez utiliser pour votre page ou votre site est d’abord trait&eacute;e
par un programme sp&eacute;cifique pour en faire un fichier t&eacute;l&eacute;chargeable,
compact, qui prendra l’extension pfr. Lors du chargement de la page par
votre visiteur, ce fichier est appel&eacute; tout comme un fichier d’image
gif ou jpeg. C’est la solution d’avenir mais encore au stade exp&eacute;rimental.
Elle est pour l’instant frein&eacute;e par leur impl&eacute;mentation diff&eacute;rente
sous Netscape et Internet Explorer [comme par hasard...] et le fait que
les programmes pour cr&eacute;er ces fichiers pfr sont des programmes propri&eacute;taires
et donc payants (ex : HexWeb Typograph de HexMac Software Systems). Mais
on sort un peu du cadre de cette partie consacr&eacute;e &agrave; l’architecture
d’un site Web.</P>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=1 WIDTH=220></P></CENTER>

<P>Finalement, la seule solution r&eacute;aliste et compatible consiste
&agrave; utiliser les polices par d&eacute;faut. En outre, le langage Html
ne vous propose que 7 tailles de police. On ne peut pas dire que les possibilit&eacute;s
soient pl&eacute;thoriques. Cette limitation (qui rappelle bien l’essence
textuelle du Web) s’adapte finalement bien &agrave; un contenu de qualit&eacute;
et une mise en page sobre. Les nuances ou les effets de la communication
sont &agrave; chercher ailleurs.</P>
</TD>
</TR>
</TABLE>
<P><BR></P>
<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD COLSPAN="2">
<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>

<TR VALIGN=TOP>
<TD ALIGN=LEFT WIDTH="80%"></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" ALT="Home" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="fram_tab.htm"><IMG SRC="ARROWUP.gif" ALT="Up" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

</BODY>

<!-- Mirrored from www.ccim.be/ccim328/archi/typo.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:13 GMT -->
</HTML>
