<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<!-- Mirrored from www.ccim.be/ccim328/archi/visuel.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:08 GMT -->
<HEAD>
<TITLE>Architecture d'un site Web - Lignes de force - Sch&eacute;ma global</TITLE>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
<META HTTP-EQUIV="Content-language" CONTENT="fr">
<META NAME="Author" CONTENT="Van Lancker Luc">
<META NAME="Description" CONTENT="Architecture d'un site Web - Réflexions et stratégies pour la conception et l'organisation d'un site Web.">
<META NAME="KeyWords" CONTENT="webdesign,webdesigner,web design,site,page,developer,dévelopement,dévelopement site,guide,webguide,site web,site internet,création site,conception site,webmaster,webmestre,webstyle,tutorial,didacticiel,html,télécharger,download">
<META NAME="rating" CONTENT="General">
<META NAME="Copyright" CONTENT="Copyright 1999 © Van Lancker Luc">
<META NAME="Identifier-URL" CONTENT="../index.html">
<META NAME="Reply-to" CONTENT="Vanlancker.Luc@ccim.be">
<META NAME="Category" CONTENT="Internet">
<META NAME="robots" CONTENT="index, follow">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#000080" VLINK="#551A8B" ALINK="#FF0000" BACKGROUND="BGPAGE.gif">

<TABLE WIDTH="600" >
<TR>
<TD><FONT COLOR="#000080"><FONT SIZE=-1>&nbsp;&nbsp;Lignes de force</FONT></FONT>

<TABLE WIDTH="100%" >
<TR VALIGN=TOP>
<TD WIDTH="80%"><B><FONT COLOR="#000080"><FONT SIZE=+3>Pr&eacute;sentation
visuelle</FONT></FONT></B></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="contenu.htm"><IMG SRC="ARROWUP.gif" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="fonction.htm"><IMG SRC="ARROWDOW.gif" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>
</TABLE>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="15"><IMG SRC="VIDE.gif" HEIGHT=12 WIDTH=12></TD>

<TD WIDTH="420"><B><I><FONT COLOR="#000080">Sans le graphisme, le Web ne
serait pas ce qu'il est. </FONT></I></B>
<P>A n'en pas douter le Web a v&eacute;ritablement d&eacute;coll&eacute;
gr&acirc;ce &agrave; son c&ocirc;t&eacute; visuel. Par visuel, nous entendons
non seulement les images et autres &eacute;l&eacute;ments graphiques mais
&eacute;galement les animations que permettent les d&eacute;veloppements
technologiques r&eacute;cents comme le Java, le Javascript et le Dhtml.
</P>
</TD>

<TD WIDTH="165">
<CENTER><P><IMG SRC="TABVISU.gif" HEIGHT=120 WIDTH=160></P></CENTER>
</TD>
</TR>
</TABLE>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD WIDTH="15"><IMG SRC="VIDE.gif" HEIGHT=12 WIDTH=12></TD>

<TD WIDTH="585">Dans les 30 secondes qui vous sont accord&eacute;es pour
convaincre un internaute &agrave; entrer dans votre site, le visuel prend
toute son importance. Un aper&ccedil;u du contenu &eacute;veillera assur&eacute;ment
son int&eacute;r&ecirc;t mais c'est le visuel qui entra&icirc;nera le clic
&quot;gagnant&quot; vers l'int&eacute;rieur de votre site. 
<P>Il ne faut cependant pas en conclure qu'il est indispensable d'&ecirc;tre
un infographiste de g&eacute;nie pour faire un site. L'important est bien
que le visuel soit adapt&eacute; &agrave; votre public...Et puis n'oubliez
pas qu'un visuel sobre, net et attrayant suffit dans la plupart des cas.</P>

<P>Soulignons aussi que le visuel doit garder le visiteur sur le contenu
et non le distraire de celui-ci. Le visuel est aussi (ou surtout ?) une
autre fa&ccedil;on de communiquer le contenu &agrave; votre visiteur. En
aucun cas, il ne sera une occasion pour vous faire plaisir ou &eacute;taler
gratuitement vos talents graphiques.</P>

<P>Enfin, n’oubliez pas que les internautes comportent, comme dans la vie
de tous les jours, leur lot de myopes, presbytes et autres daltoniens.
Pensez &agrave; eux avec des couleurs nettes et des images vraiment informatives.</P>

<P>Le visuel est aussi fort utile pour structurer votre propos et agr&eacute;menter
votre mise en page. On veillera &agrave; cr&eacute;er tout au long des
pages d'un site une identit&eacute; et/ou une coh&eacute;rence visuelle
qui guidera l'internaute tout au long de sa visite. On pr&ecirc;tera une
attention particuli&egrave;re &agrave; cette identit&eacute; visuelle lorsque
plusieurs personnes participent &agrave; l'&eacute;laboration du site.</P>

<P>Cet aspect visuel doit imp&eacute;rativement tenir compte de l'aspect
fonctionnel de la publication sur Internet et tout sp&eacute;cialement
du temps de chargement des images et du temps de r&eacute;ponse des animations
(Java et dans une mesure moindre le Dhtml). Mis &agrave; part les sites
&agrave; caract&egrave;re pornographique, le d&eacute;lai de p&eacute;remption
de la patience de l'internaute moyen est vite &eacute;puis&eacute;... A
ce stade de d&eacute;veloppement d'Internet et des t&eacute;l&eacute;communications,
le visuel et sp&eacute;cialement la taille des images sont encore toujours
une question de compromis. On oublie trop vite qu’un site se juge en ligne
&agrave; partir du r&eacute;seau et non &agrave; partir de son disque dur
!</P>

<P>Notons pour terminer que le visuel d'un site vieillira bien plus vite
que le contenu. La Web a ses modes (mais oui, mais oui...) et il faudra
penser &agrave; rafra&icirc;chir r&eacute;guli&egrave;rement le visuel
de votre site. </P>
</TD>
</TR>
</TABLE>

<P><BR>
</P>

<TABLE WIDTH="600" >
<TR ALIGN=LEFT VALIGN=TOP>
<TD COLSPAN="2">
<CENTER><P><IMG SRC="ALIGNE.gif" HEIGHT=2 WIDTH=590></P></CENTER>
</TD>
</TR>

<TR VALIGN=TOP>
<TD ALIGN=LEFT WIDTH="80%"></TD>

<TD ALIGN=RIGHT><A HREF="idx.htm"><IMG SRC="home.gif" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="contenu.htm"><IMG SRC="ARROWUP.gif" BORDER=0 HEIGHT=29 WIDTH=26></A><A HREF="fonction.htm"><IMG SRC="ARROWDOW.gif" BORDER=0 HEIGHT=29 WIDTH=26></A></TD>
</TR>
</TABLE>

</BODY>

<!-- Mirrored from www.ccim.be/ccim328/archi/visuel.htm by HTTrack Website Copier/3.x [XR&CO'2004], Mon, 05 Dec 2005 18:32:08 GMT -->
</HTML>
